{
    "s": 1,
    "d": [
        {
            "id": "1770",
            "Title": "E.L.T. (Egg, Lettuce, and Tomato Sandwich)",
            "Ingredients": {
                "1": "2 slices white sandwich bread",
                "2": "1/4 cup Hellmann’s or Best Foods mayonnaise, divided",
                "3": "2 thick ripe beefsteak tomato slices",
                "4": "Kosher salt, freshly ground pepper",
                "5": "2 hard-boiled eggs, peeled, sliced crosswise",
                "6": "3 leaves iceberg lettuce"
            },
            "Instructions": "Spread both sides of bread slices all the way to the edges with the thinnest layer of mayonnaise possible. Heat a dry large skillet over medium-low; cook bread until golden, about 3 minutes per side. Transfer to a plate; let cool. Spread remaining mayonnaise over both slices of bread. Top a slice with tomatoes; season generously with salt and pepper. Arrange eggs over tomatoes; season. Top with lettuce, close sandwich, and cut in half.",
            "Image": "//20fix.com/xfood/img/elt-egg-lettuce-and-tomato-sandwich.jpg"
        },
        {
            "id": "1821",
            "Title": "Brownie Ice-Cream Sandwich",
            "Ingredients": {
                "1": "1 x My Favorite Brownie recipe",
                "2": "200ml (3/4 cup) sweetened condensed milk",
                "3": "600ml (2 1/2 cups) heavy cream",
                "4": "1 tsp vanilla bean paste",
                "5": "100g (3.5-oz) Oreos, or cookie of your choice",
                "6": "You will also need two or three 20x30cm (8x12-inch) brownie tins and an electric handheld whisk."
            },
            "Instructions": "Line one 20x30cm (8x12-inch) tin with cling film.\nIn a large bowl, whisk together the condensed milk, heavy cream, and vanilla using an electric hand-held whisk until the mixture thickens and holds its shape when you take the whisk out. Put the cookies into a plastic bag and bash them with a rolling pin to make crumbs. If you want larger chunks, you could crumble them by hand. Fold the cookie crumbs into the ice-cream mixture, then scrape into the prepared tin. Use a spatula to smooth it out, then freeze for at least two hours or until firm.\nPreheat the oven to 350°F/180°C/160°C fan/gas 4. Make My Favorite Brownie recipe up to step 4, but don't put the mixture in the tin yet.\nDivide the brownie mixture between two lined 20x30cm (8x12-inch) brownie tins (or use one and bake two batches) and use a spatula to spread the batter right into the edges. It will be very thin, as these will be your sandwich layers. Bake each tray for ten minutes, then remove from the oven and leave to cool completely in the tin.\nRemove the brownie layers from the tins and re-line one of the tins with another sheet of baking parchment. Put one brownie layer into the tin, then press the ice-cream layer on the top of it. Add the final layer then return to the freezer for at least 30 minutes.\nRemove the ice-cream sandwich slab from the freezer about ten minutes before serving. Use a sharp knife or pastry cutter to cut shapes—I like the effect of a circular cutter.",
            "Image": "//20fix.com/xfood/img/brownie-ice-cream-sandwich.jpg"
        },
        {
            "id": "321",
            "Title": "Greek Turkey Burgers",
            "Ingredients": {
                "1": "2 pounds ground 93 percent lean turkey breast",
                "2": "1 cup packed fresh spinach leaves, finely chopped",
                "3": "¼ cup pitted black olives, finely chopped",
                "4": "Zest of 1 lemon",
                "5": "2 tablespoons finely chopped red onion",
                "6": "1 tablespoon finely chopped fresh mint or parsley",
                "7": "1 teaspoon garlic powder, or 3 fresh garlic cloves, finely chopped",
                "8": "1 teaspoon dried oregano",
                "9": "1 teaspoon sea salt",
                "10": "½ teaspoon ground black pepper",
                "11": "Olive oil or ghee for frying",
                "12": "Optional toppings: butter lettuce, sliced tomato, sliced red onion, sliced cucumber, more fresh mint or parsley, basil pesto, or feta cheese"
            },
            "Instructions": "In a large mixing bowl, use your hands to combine well the turkey meat with the spinach, olives, lemon zest, onion, mint or parsley, garlic, oregano, salt, and pepper. But don’t overmix or the meat with become tough. Divide the mixture into 6 equal portions and shape them into burgers.\nWarm about a tablespoon of olive oil or ghee in a large skillet set over medium-high heat. Working in batches, add the burger patties and fry them on one side for about 5 minutes, then flip them, frying on the second side for another 4 to 5 minutes, or until they’re golden brown.\nIf you like, serve each burger on a large piece of butter lettuce and top them with any of the optional ingredients.",
            "Image": "//20fix.com/xfood/img/greek-turkey-burgers.jpg"
        },
        {
            "id": "422",
            "Title": "Chickpea-Mushroom Burgers",
            "Ingredients": {
                "1": "1/2 cup red or black quinoa, rinsed",
                "2": "Kosher salt",
                "3": "1/2 cup extra-virgin olive oil, divided, plus more for drizzling",
                "4": "2 (14.5-oz.) cans chickpeas, rinsed, drained",
                "5": "1 tsp. garlic powder",
                "6": "1/2 tsp. smoked paprika",
                "7": "8 oz. crimini mushrooms, trimmed, cut into 1/4\" pieces",
                "8": "1/4 cup tahini",
                "9": "1/4 cup white miso",
                "10": "1/4 cup oat flour or all-purpose flour",
                "11": "8 slices sharp cheddar or vegan cheese",
                "12": "Mayonnaise, mustard, hamburger buns, shredded iceberg lettuce, and sliced pickles (for serving; optional)"
            },
            "Instructions": "Cook quinoa in a large saucepan of lightly salted boiling water, stirring occasionally, until tender, 8–10 minutes. Drain well and let cool at least 10 minutes.\nMeanwhile, heat 1/4 cup oil in a large nonstick skillet over medium-high. Add chickpeas (make sure they are well drained) and cook, tossing occasionally, until lightly browned, 8–10 minutes. Add garlic powder and paprika and toss a few times to coat. Transfer to a large bowl and let cool about 5 minutes.\nAdd mushrooms, tahini, miso, and 1/4 cup oil to bowl with chickpeas and mash with a potato masher or fork to combine. Add quinoa and flour and mash until mixture holds together when squeezed in your hand. Taste and season with salt if needed. Form into 8 patties and arrange on a parchment-lined rimmed baking sheet. Freeze until firm, about 2 hours. At this point, the patties can be baked, or they can stay frozen up to 3 months. Transfer to resealable freezer bags or layer in an airtight container with sheets of parchment between patties.\nPreheat oven to 425°. Drizzle frozen patties generously with oil on both sides on a rimmed baking sheet. Bake patties until browned and crisp, 25–30 minutes. Place a slice of cheese on top of each patty and bake until cheese is melted, about 1 minute.\nSpread mayonnaise and mustard on cut sides of buns (if using). Place burgers on bottom buns. Top with lettuce and pickles (if using) and close up burgers.\nDo Ahead: Patties can be made 3 months ahead. Transfer to a resealable freezer bag and freeze.",
            "Image": "//20fix.com/xfood/img/chickpea-mushroom-burgers.jpg"
        },
        {
            "id": "13",
            "Title": "Caesar Salad Roast Chicken",
            "Ingredients": {
                "1": "8 anchovies, mashed to a paste",
                "2": "8 garlic cloves, finely grated",
                "3": "6 Tbsp. mayonnaise, divided",
                "4": "1 Tbsp. Dijon mustard, plus more for serving",
                "5": "2 Tbsp. extra-virgin olive oil, divided",
                "6": "1½ tsp. freshly ground black pepper, plus more",
                "7": "1 (3½–4-lb.) whole chicken or 4 chicken legs (thigh and drumstick; about 3 lb.)",
                "8": "Kosher salt",
                "9": "8 medium shallots, unpeeled, halved lengthwise",
                "10": "2 lemons, divided",
                "11": "1 oz. Parmesan, finely grated",
                "12": "4 oz. country-style bread, torn into (1½\") pieces",
                "13": "2 romaine hearts, leaves separated, torn"
            },
            "Instructions": "Place a rack in lower third of oven; preheat to 450°F. Whisk anchovies, garlic, 3 Tbsp. mayonnaise, 1 Tbsp. mustard, 1 Tbsp. oil, and 1½ tsp. pepper in a small bowl. Set aside 1 Tbsp. anchovy mayo in another small bowl.\nPat chicken dry; season outside and inside all over with salt. Arrange breast side up in a cast-iron skillet and tuck wings underneath. Arrange shallots around (if using legs, nestle under and around); season with salt and pepper. Brush remaining anchovy mayo all over chicken, making sure to get it into the nooks and crannies, then brush shallots with any leftover anchovy mayo.\nPlace chicken in oven so legs are facing toward the back (this is the hottest part of the oven and will help the legs cook before the breast dries out) and roast until some anchovy mayo and fat begin to drip onto shallots, about 15 minutes. Remove from oven and, using tongs, turn shallots to coat in drippings. Return skillet to oven and continue to roast chicken, stirring shallots once or twice, until golden brown and an instant-read thermometer inserted into the thickest part of breast registers 155°F, 45–55 minutes. If skin starts to get too dark on the top before chicken is done, tent area with foil, leaving the rest of the bird exposed. If using chicken legs, start checking at 40 minutes (a thermometer inserted right at the joint should register 160°F). Transfer chicken and shallots to a cutting board, leaving behind any juices and fat in skillet. If shallots need more time to soften and darken, roast a bit longer without chicken before proceeding. Reserve skillet.\nReduce oven temperature to 400°F. Finely grate half of zest of 1 lemon into a large bowl; cut lemon in half and squeeze in juice. Add reserved 1 Tbsp. anchovy mayo, remaining 3 Tbsp. mayo, and remaining 1 Tbsp. oil and whisk to combine, then stir in Parmesan. Season with salt and pepper. Set dressing aside.\nAdd bread to reserved skillet with fat and turn to coat. Return skillet to oven and toast bread, tossing halfway through, until golden brown and crisp, 12–15 minutes. Transfer croutons to bowl with reserved dressing. Add romaine and gently toss until lettuce is well coated. Season salad with salt and pepper.\nSlice remaining lemon into wedges. Carve chicken and nestle back into skillet or transfer to a platter; arrange shallots and lemon wedges around. Serve with salad and more mustard alongside.",
            "Image": "//20fix.com/xfood/img/caesar-salad-roast-chicken.jpg"
        },
        {
            "id": "14",
            "Title": "Chicken and Rice With Leeks and Salsa Verde",
            "Ingredients": {
                "1": "1½ lb. skinless, boneless chicken thighs (4–8 depending on size)",
                "2": "Kosher salt, freshly ground pepper",
                "3": "3 Tbsp. unsalted butter, divided",
                "4": "2 large or 3 medium leeks, white and pale green parts only, halved lengthwise, thinly sliced",
                "5": "Zest and juice of 1 lemon, divided",
                "6": "1½ cups long-grain white rice, rinsed until water runs clear",
                "7": "2¾ cups low-sodium chicken broth",
                "8": "1 oil-packed anchovy fillet",
                "9": "2 garlic cloves",
                "10": "1 Tbsp. drained capers",
                "11": "Crushed red pepper flakes",
                "12": "1 cup tender herb leaves (such as parsley, cilantro, and/or mint)",
                "13": "4–5 Tbsp. extra-virgin olive oil"
            },
            "Instructions": "Season chicken with salt and pepper. Melt 2 Tbsp. butter in a large high-sided skillet over medium-high heat. Add leeks and half of lemon zest, season with salt and pepper, and mix to coat leeks in butter. Reduce heat to medium-low, cover, and cook, stirring occasionally, until leeks are somewhat tender, about 5 minutes. Remove lid, increase heat to medium-high, and cook, stirring occasionally, until tender and just starting to take on color, about 3 minutes. Add rice and cook, stirring often, 3 minutes, then add broth, scraping up any browned bits. Tuck short sides of each chicken thigh underneath so they are touching and nestle seam side down into rice mixture. Bring to a simmer. Cover, reduce heat to medium-low, and cook until rice is tender and chicken is cooked through, about 20 minutes. Remove from heat. Cut remaining 1 Tbsp. butter into small pieces and scatter over mixture. Re-cover and let sit 10 minutes.\nMeanwhile, pulse anchovy, garlic, capers, a few pinches of red pepper flakes, and remaining lemon zest in a food processor until finely chopped. Add herbs; process until a paste forms. With motor running, gradually stream in oil until loosened to a thick sauce. Add half of lemon juice; season salsa verde with salt.\nDrizzle remaining lemon juice over chicken and rice. Serve with salsa verde.",
            "Image": "//20fix.com/xfood/img/chicken-and-rice-with-leeks-and-salsa-verde.jpg"
        },
        {
            "id": "1681",
            "Title": "Butter Chicken",
            "Ingredients": {
                "1": "2 pounds boneless, skinless chicken breast halves",
                "2": "1 tablespoon fresh lemon juice",
                "3": "1 teaspoon red (Kashmiri) chile powder",
                "4": "1 cup plain yogurt",
                "5": "1 teaspoon ground turmeric",
                "6": "1 teaspoon garam masala",
                "7": "3 garlic cloves, minced",
                "8": "1 tablespoon grated fresh ginger",
                "9": "1 tablespoon sunflower or",
                "10": "Vegetable oil",
                "11": "1 teaspoon sea salt",
                "12": "2 tablespoons butter, melted",
                "13": "4 tablespoons (1/2 stick) butter",
                "14": "2 whole cloves",
                "15": "4 green cardamom pods",
                "16": "1 black cardamom pod",
                "17": "1 (2-inch) piece cinnamon stick",
                "18": "8 garlic cloves, minced",
                "19": "1 tablespoon minced fresh ginger",
                "20": "1/2 teaspoon fenugreek seeds",
                "21": "1 or 2 red chiles, diced",
                "22": "1/4 cup tomato paste",
                "23": "1 (28-ounce) can crushed tomatoes",
                "24": "1 teaspoon red (Kashmiri) chile powder",
                "25": "3 cups chicken stock",
                "26": "1 teaspoon sea salt",
                "27": "1 tablespoon pure maple syrup",
                "28": "1 tablespoon crushed dried fenugreek leaves (find these at a specialty grocer or online)",
                "29": "1 cup heavy cream",
                "30": "1 tablespoon garam masala",
                "31": "Heavy cream",
                "32": "Fresh cilantro",
                "33": "Sliced red chiles",
                "34": "Rice or naan"
            },
            "Instructions": "Cut the chicken into 1-inch chunks and toss them with the lemon juice and chile powder. Transfer to a container and refrigerate for 20 minutes.\nIn a small dish, combine the yogurt, turmeric, garam masala, garlic, ginger, sunflower oil, and salt. Stir well. Massage the chicken with the yogurt marinade, cover the container, and refrigerate overnight or for at least 12 hours. Dream about delicious curry all night long.\nPreheat the oven to 400°F. Soak 10 to 12 bamboo skewers in cold water for about 20 minutes.\nThread the chicken onto the skewers and transfer to a rack set on a baking sheet. Bake the chicken skewers, turning halfway through, for 12 minutes, or until the juices run clear and the chicken is cooked through. Brush the chicken all over with the melted butter and set aside.\nIn a large heavy-bottomed pot or Dutch oven, melt the butter over medium heat. Add the cloves, cardamom pods, and cinnamon stick and cook for 2 to 3 minutes, until fragrant. Stir in the garlic, ginger, fenugreek seeds, chiles, and tomato paste and cook for 2 minutes, stirring often. Stir in the tomatoes and chile powder and cook, stirring often to keep the sauce from sticking to the pot, for 20 minutes.\nTurn off the heat and purée the sauce directly in the pot with an immersion blender. (Alternatively, carefully transfer the sauce to a regular blender and purée—be careful when blending hot liquids.) Turn the heat to medium and stir in the stock and sea salt. Bring to a simmer and cook for 15 minutes, or until the sauce has started to thicken beautifully.\nRemove the chicken pieces from the skewers and stir them into the curry, along with the maple syrup and dried fenugreek leaves. Cover and cook for 8 minutes. Turn the heat to medium- low and stir in the cream and garam masala. Simmer the sauce for a final 5 minutes.\nTop each bowl of curry with a drizzle of cream, fresh cilantro, and sliced red chiles, if you like it spicy. Serve with rice or naan. Immediately enter comfort food heaven.",
            "Image": "//20fix.com/xfood/img/indian-style-butter-chicken-curry.jpg"
        },
        {
            "id": "11965",
            "Title": "Grilled Indian-Spiced Butter Chicken",
            "Ingredients": {
                "1": "1 cup chopped onion (1 medium)",
                "2": "3 tablespoons finely chopped garlic",
                "3": "2 tablespoons finely chopped peeled fresh ginger",
                "4": "1 1/4 teaspoons salt",
                "5": "1 small green fresh Thai or serrano chile, coarsely chopped, including seeds",
                "6": "1 teaspoon white distilled vinegar', \"1/3 cup thick plain yogurt, such as Greek yogurt or lebneh, or drained regular yogurt (see cooks' note, below)\", '1 1/2 tablespoons ground coriander",
                "7": "1 tablespoon vegetable oil",
                "8": "1 teaspoon ground turmeric",
                "9": "1/2 teaspoon cayenne",
                "10": "1 (3- to 3 1/2-lb) chicken, quartered, then backbone and as much skin as possible discarded",
                "11": "1 stick (1/2 cup) unsalted butter"
            },
            "Instructions": "Purée onion, garlic, ginger, salt, chile, and vinegar to a smooth paste in a food processor. Transfer to a large wide bowl and whisk in yogurt, coriander, oil, turmeric, and cayenne. Add chicken pieces and turn to coat thickly. Cover with plastic wrap and marinate, chilled, at least 16 hours. Let stand at room temperature 30 minutes before grilling.\nBring butter to a boil in a 1-quart heavy saucepan over moderate heat. When foam completely covers butter, reduce heat to very low. Cook butter until a very thin crust begins to form on surface and milky white solids fall to bottom of pan, about 8 minutes. Continue to cook butter, watching constantly, until solids at bottom of pan turn light brown and butter has a nutty fragrance, 8 to 16 minutes.\nRemove pan from heat and let butter stand 1 minute. Pour through a sieve lined with a dampened heavy-duty paper towel or a triple layer of cheesecloth into a bowl, discarding solids.\nPrepare grill for cooking over indirect heat with medium-hot charcoal (moderate heat for gas); see Grilling Procedure .\nTo cook chicken using a charcoal grill: Lightly oil grill rack. Put chicken (still heavily coated with marinade) on rack over area of grill with no coals underneath. Drizzle chicken with about 1 tablespoon ghee. Cook chicken over medium-high heat, turning over and drizzling with ghee every 5 minutes, until cooked through, 20 to 25 minutes.\nTo cook chicken using a gas grill: Lightly oil grill rack. Put chicken over shut-off burner. Cook chicken, turning over and drizzling with ghee every 5 minutes, until cooked through, about 20 to 25 minutes. (Cover grill between turns.)\nServe chicken drizzled with any remaining ghee.",
            "Image": "//20fix.com/xfood/img/grilled-indian-spiced-butter-chicken-234646.jpg"
        },
        {
            "id": "1869",
            "Title": "Pesto–Heirloom Tomato Pizza",
            "Ingredients": {
                "1": "1 to 2 cloves garlic, crushed (optional)",
                "2": "1/2 to 1 cup firmly packed fresh basil leaves, or to taste",
                "3": "Juice of 1/2 lemon or 2 tablespoons bottled lemon juice, or more to taste",
                "4": "1/2 cup walnut halves or shelled unsalted pistachios or 1/4 cup pine nuts (omit nuts if you’d like a less caloric pesto)",
                "5": "6 ounces baby spinach, arugula, watercress, or a combination",
                "6": "Salt and freshly ground pepper to taste",
                "7": "Whole-Wheat Pizza Crust",
                "8": "Heirloom tomatoes, sliced, to taste (preferably a mix of yellow and red varieties)",
                "9": "Basil leaves, thinly sliced, for topping",
                "10": "Vegan Parmesan-style cheese and fresh oregano for topping (optional)"
            },
            "Instructions": "Combine the first five ingredients in a food processor and pulse until the mixture is evenly combined yet still coarse in texture. You may need to add the spinach in batches if your processor has a small or medium-size container.\nStop the machine and season the mixture gently with salt and pepper; taste to see if you'd like to add more lemon juice, then pulse a few times to mix.\nBake pizza dough rounds in a preheated 425°F oven for 15 minutes, until crust is golden.\nSpread pizza crust with pesto, then load up with sliced heirloom tomatoes. Sprinkle with salt and pepper and top with plenty of thinly sliced basil leaves. Some Vegan Parmesan-style cheese and fresh oregano leaves would add a nice touch, too. This can be served at room temperature.",
            "Image": "//20fix.com/xfood/img/pestoheirloom-tomato-pizza.jpg"
        },
        {
            "id": "1885",
            "Title": "Whole-Wheat Pizza Crust",
            "Ingredients": {
                "1": "2 envelopes active dry yeast",
                "2": "1/4 cup safflower or extra-virgin olive oil",
                "3": "2 tablespoons natural granulated sugar",
                "4": "2 cups whole-wheat flour",
                "5": "3 cups unbleached all-purpose flour",
                "6": "1 teaspoon salt"
            },
            "Instructions": "Combine the yeast with 2 cups warm water in a medium bowl. Let stand for 10 minutes to dissolve. Stir in the oil and sugar.\nIn a large mixing bowl, combine the flours and salt. Make a well in the center and stir in the yeast mixture. Work everything together, first with a wooden spoon and then with your hands, to form a dough.\nTurn out the dough onto a well-floured board and knead it for 8 minutes, adding flour until the dough loses its stickiness. Place the dough in a floured bowl, cover it with a tea towel, and put it in a warm place. Let it rise until doubled in bulk, about 1 to 1 1/2 hours.\nPunch the dough down and divide it into two rounds. Roll out one round on a well-floured board into a circle about 12 to 14 inches in diameter. Repeat with the other round.\nSprinkle two 12–14-inch pizza pans with cornmeal. Lay the rounds on the pans and stretch to fit. Arrange the toppings of your choice on the dough and bake as directed.",
            "Image": "//20fix.com/xfood/img/whole-wheat-pizza-crust.jpg"
        },
        {
            "id": "2024",
            "Title": "White Pizza with Shaved Vegetables and Pesto",
            "Ingredients": {
                "1": "1/2 cup whole-milk ricotta",
                "2": "16 ounces prepared pizza dough, room temperature",
                "3": "2 tablespoons plus 1 teaspoon olive oil, divided, plus more for pan",
                "4": "1 medium zucchini (about 8 ounces), trimmed, thinly shaved with a vegetable peeler",
                "5": "2 small leeks, whites and pale-green parts cut into half moons, very thinly sliced (about 1 cup)",
                "6": "4 ounces asparagus, trimmed, thinly shaved with a vegetable peeler",
                "7": "1/2 cup frozen sweet peas, thawed",
                "8": "1/2 teaspoon kosher salt",
                "9": "1/2 cup shredded low-moisture mozzarella",
                "10": "1/4 cup homemade or store-bought pesto",
                "11": "1 garlic clove, finely chopped",
                "12": "1/2 teaspoon finely grated lemon zest",
                "13": "1/2 cup watercress",
                "14": "1/4 cup torn basil",
                "15": "1.5 ounces Pecorino, shaved into curls with a vegetable peeler (about 1/2 cup)",
                "16": "1/3 cup unsalted, roasted pistachios, coarsely chopped"
            },
            "Instructions": "Place a rack in lower third of oven; preheat to 500°F. Drain ricotta in a paper towel-lined colander.\nGently stretch dough to a 16x12\" oval and transfer to a lightly oiled rimmed baking sheet. (If dough springs back, cover with plastic wrap and let rest 10 minutes, then stretch again, resting as needed.) Brush with 1 Tbsp. oil, then bake until dry and golden, about 5 minutes.\nMeanwhile, toss zucchini, leeks, asparagus, peas, salt, and 1 Tbsp. oil in a medium bowl. Whisk ricotta, mozzarella, pesto, garlic, and lemon zest in another medium bowl until smooth.\nSpread ricotta mixture over dough, then arrange vegetables over. Bake pizza, rotating pan halfway through, until cheese is melted, vegetables are roasted and tender, and crust is golden brown, 7–9 minutes.\nMeanwhile, toss watercress and basil with remaining 1 tsp. oil. Remove baking sheet from oven, then transfer pizza with a pizza peel or offset spatula to wire rack. Top pizza with watercress mixture, Pecorino, and pistachios. Let cool slightly, then cut into wedges and serve.",
            "Image": "//20fix.com/xfood/img/white-pizza-with-shaved-vegetables-and-pesto.jpg"
        },
        {
            "id": "2058",
            "Title": "Blood Orange–Champagne Ice Cream Float",
            "Ingredients": {
                "1": "15ml (3 teaspoons) Champagne or sparkling wine (this can be flat, left over from a party)",
                "2": "15g (about 3 1/4 teaspoons) caster or superfine sugar",
                "3": "25ml (5 teaspoons) Cocchi Vermouth di Torino",
                "4": "15ml (3 teaspoons) Campari",
                "5": "35ml (about 2 tablespoons plus 1 teaspoon) soda water",
                "6": "2 scoops of orange sorbet, preferably blood orange",
                "7": "A slice of orange (use blood orange, if in season)"
            },
            "Instructions": "Put the Champagne or sparkling wine in a small pan and simmer until reduced by a third. Add the caster sugar and stir until dissolved, then leave to cool. (It’s worth making a much larger quantity of this syrup and storing it in the fridge to make other drinks.)\nPour the vermouth, Campari, Champagne syrup, and soda water into a small shaker and shake for 10-15 seconds. Scoop the sorbet into a chilled float glass. Pour the liquid ingredients on top and garnish with the slice of orange.",
            "Image": "//20fix.com/xfood/img/blood-orange-champagne-ice-cream-float.jpg"
        },
        {
            "id": "2507",
            "Title": "Braised and Brûléed Apples with Ice Cream",
            "Ingredients": {
                "1": "4 cups unfiltered apple cider",
                "2": "3/4 cup pure maple syrup",
                "3": "4 tablespoons unsalted butter",
                "4": "2 tablespoons apple cider vinegar",
                "5": "Pinch of kosher salt",
                "6": "4 large firm baking apples, halved, cored with a melon baller",
                "7": "1/4 cup heavy cream",
                "8": "1 cup sugar",
                "9": "2 pints vanilla ice cream",
                "10": "Candied or unsalted, roasted nuts (for serving)",
                "11": "A kitchen torch (optional)"
            },
            "Instructions": "Bring apple cider, maple syrup, butter, vinegar, and salt to a simmer in a large Dutch oven or other heavy pot over medium-low heat, stirring to melt butter. Add apples to pot in a single layer (you might need to cook in batches depending on the size of your pot) and return liquid to a very gentle simmer. Cook, turning apples halfway through, until a skewer (or the tip of a small knife) slides easily through flesh but apples stay intact, 20–25 minutes; set aside.\nRemove apples from pot with a slotted spoon and place, cut side up, on a rimmed baking sheet; set aside. Bring liquid in pot to a boil over medium-high heat. Cook, swirling occasionally, until reduced to a thick caramel with bubbles that slowly expand and then pop, 15–20 minutes. Add cream and stir until sauce is smooth. Reduce heat to low and keep sauce warm in pot while you brûlée the caramel apples.\nSprinkle cut sides of reserved apples with sugar and caramelize with kitchen torch (alternatively, you can brûlée them under the broiler, about 3 minutes).\nTo serve, scoop ice cream into bowls; place an apple half, brûléed side up, in each. Drizzle with warm caramel sauce and top with some nuts.\nApples can be braised 1 day ahead. Let cool in liquid, then cover and chill. Reheat over low before continuing.",
            "Image": "//20fix.com/xfood/img/braised-and-bruleed-apples-with-ice-cream.jpg"
        },
        {
            "id": "2664",
            "Title": "Cinnamon Swirl Vanilla Ice Cream Bars",
            "Ingredients": {
                "1": "1/4 cup heavy cream",
                "2": "2 teaspoons ground cinnamon",
                "3": "Kosher salt",
                "4": "1 1/2 cups natural almond or other nut butter, divided",
                "5": "1 cup (packed) light brown sugar, divided",
                "6": "2 pints vanilla ice cream",
                "7": "1 cup virgin coconut oil, melted",
                "8": "2/3 cup chopped pretzel sticks",
                "9": "Flaky sea salt"
            },
            "Instructions": "Line an 8x8\" baking pan, preferably metal, with plastic wrap, leaving generous overhang on all sides and let chill in freezer 10 minutes.\nMeanwhile, blend cream, cinnamon, a pinch of kosher salt, 1/2 cup almond butter, and 1/2 cup brown sugar in a blender, adding 1–2 Tbsp. water if mixture is too thick or looks broken, until smooth and thick but pourable.\nPeel away sides of containers from ice cream. Cut ice cream into 2\" pieces and place in a medium bowl. Let sit until slightly softened, about 5 minutes, then stir with a wooden spoon or large rubber spatula until the consistency of thick cake batter. Scrape almond-butter mixture into bowl with ice cream and fold several times with a rubber spatula to create a marbled effect (do not overmix; you want defined ribbons running through). Scrape into prepared baking pan and spread out into an even layer. Smooth top, then bring plastic up and over ice cream. Freeze until hard, about 12 hours.\nLine 2 rimmed baking sheets with parchment paper and place in freezer. (Freeze at least 15 minutes before using to ensure they are properly chilled.) Remove baking pan with ice cream from freezer. Use edges of plastic to unmold ice cream and place on a cutting board; peel off plastic. Use a dry hot knife (run under hot water and wipe dry between slices) to cut ice cream into a 6x4 grid to make 24 bars (if ice cream starts to soften, freeze again until firm before proceeding). Place bars on chilled baking sheet, spacing evenly; freeze until firm, 40–45 minutes.\nWhisk coconut oil, a pinch of kosher salt, remaining 1 cup almond butter, and remaining 1/2 cup brown sugar in a small bowl until smooth. Working one at a time and using a fork, dip ice cream bars into coconut-oil mixture, allowing excess to drip back into bowl, then place on remaining chilled baking sheet and immediately sprinkle with pretzels and sea salt. Return ice cream to freezer from time to time while you work if it becomes too soft.\nFreeze bars until ice cream and nut-butter shells are hard, at least 1 hour, before serving.\nBars can be made 1 week ahead. Once frozen solid, wrap in plastic; keep frozen.",
            "Image": "//20fix.com/xfood/img/cinnamon-swirl-vanilla-ice-cream-bars.jpg"
        },
        {
            "id": "2276",
            "Title": "Spinach-Artichoke Flatbread Pizzas",
            "Ingredients": {
                "1": "1 cup balsamic vinegar",
                "2": "6 Flatout Light Italian Herb flatbreads",
                "3": "3/4 cup Prego Light Homestyle Alfredo sauce",
                "4": "6 cups baby spinach",
                "5": "3 cups grape tomatoes, halved",
                "6": "1 (15-ounce) can quartered artichoke hearts, drained and chopped",
                "7": "3/4 cup shredded reduced-fat mozzarella cheese (I like Sargento)"
            },
            "Instructions": "Preheat the oven to 350˚F. Line 2 baking sheets with foil.\nIn a small saucepan, bring the balsamic vinegar to a boil over medium heat. Reduce the heat to medium-low and simmer until the balsamic vinegar starts to thicken and has reduced by half, 20 to 25 minutes.\nMeanwhile, lay out the flatbreads on the prepared baking sheets and coat with cooking spray. Bake for 5 to 6 minutes. Remove from the oven but leave the oven on.\nSpread 2 tablespoons Alfredo sauce evenly onto each flatbread. Top each with 1 cup spinach, 1/2 cup grape tomatoes, 1/4 cup artichokes, and 2 tablespoons mozzarella.\nReturn to the oven and bake until the cheese is melted, 7 to 9 minutes. Remove from the oven and drizzle the balsamic reduction evenly over each pizza.",
            "Image": "//20fix.com/xfood/img/spinach-artichoke-flatbread-pizzas.jpg"
        },
        {
            "id": "2449",
            "Title": "Thanksgiving Skillet Pizza",
            "Ingredients": {
                "1": "All-purpose flour (for surface)",
                "2": "8 ounces prepared pizza dough, room temperature",
                "3": "3 tablespoons olive oil, divided",
                "4": "1 1/2 cups shredded cooked turkey or rotisserie chicken",
                "5": "1/4 cup cranberry sauce, plus more for serving (optional)",
                "6": "1 cup mashed white or sweet potatoes",
                "7": "Kosher salt, freshly ground black pepper",
                "8": "2 cups shredded mozzarella, cheddar, and/or Fontina cheese (about 6 ounces), divided",
                "9": "1 cup cooked vegetables, such as green beans, Brussels sprouts, sautéed greens, carrots, squash, or mushrooms",
                "10": "1/2 cup sliced red onion",
                "11": "Pinch crushed red pepper flakes (optional)",
                "12": "A 12-inch cast-iron skillet"
            },
            "Instructions": "Place a rack in upper third of oven; preheat to 500°F. On a lightly floured surface, roll dough to a 12\" round (if dough springs back, cover with plastic and let rest 5 minutes, then roll again, resting as needed).\nHeat 2 Tbsp. oil in a cast-iron skillet over medium-high until very hot. Carefully transfer dough to skillet. Brush top of dough with remaining 1 Tbsp. oil. Cook, shaking pan occasionally and turning pan to avoid hot spots, until bottom of dough is golden brown and crispy, 3–4 minutes.\nMeanwhile, toss turkey with 1/4 cup cranberry sauce, if using, in a medium bowl.\nRemove skillet from heat. Using a large flat spatula, flip dough. Spread potatoes over dough, leaving a 3/4\" border on all sides; season with salt and pepper. Top with 1 cup cheese, then turkey mixture, vegetables, and onion. Top with remaining 1 cup cheese and red pepper flakes, if using. Bake pizza until dough is golden brown and cheese is melted, 6–8 minutes.\nTransfer pizza to a cutting board and cut into wedges. Serve with additional cranberry sauce alongside, if using.",
            "Image": "//20fix.com/xfood/img/thanksgiving-skillet-pizza.jpg"
        },
        {
            "id": "2564",
            "Title": "Cauliflower Pizzas With Mozzarella, Kale, and Lemon",
            "Ingredients": {
                "1": "6 cups (600g) cauliflower florets, roughly chopped",
                "2": "3/4 cup (90g) almond meal (ground almonds)",
                "3": "1/2 cup (40g) finely grated Parmesan",
                "4": "3 eggs, lightly beaten",
                "5": "Sea salt and cracked black pepper",
                "6": "8 stalks kale, trimmed",
                "7": "2 tablespoons extra virgin olive oil",
                "8": "3 cloves garlic, sliced",
                "9": "1/2 teaspoon dried chile flakes",
                "10": "1 tablespoon lemon zest",
                "11": "1/4 cup (20g) finely grated Parmesan",
                "12": "1 (125g) ball buffalo mozzarella, torn",
                "13": "1/3 cup small basil leaves"
            },
            "Instructions": "Preheat oven to 400°F (200°C). To make the cauliflower pizza crust, lightly grease two 12-inch round pizza trays and line with non-stick baking paper. Place the cauliflower, in batches, in a food processor and process until the mixture resembles fine crumbs. Transfer to a large bowl, add the almond meal, Parmesan, egg, salt and pepper and mix until a soft dough forms. Divide the mixture in half and press into the prepared trays. Bake for 20–25 minutes or until golden and crisp.\nPlace the kale, oil, garlic, chile and lemon zest in a bowl and toss to coat. Divide the mixture between the bases and top with the Parmesan. Bake for 8–10 minutes or until the kale is crisp. Top each pizza with mozzarella and basil to serve.",
            "Image": "//20fix.com/xfood/img/gluten-free-cauliflower-pizza-with-mozzarella-kale-and-lemon.jpg"
        },
        {
            "id": "2642",
            "Title": "Zucchini Pizza Crust With Lemony Pea Pesto",
            "Ingredients": {
                "1": "1 (10-ounce) bag frozen peas",
                "2": "2 tablespoons pine nuts, toasted",
                "3": "2 cloves garlic, minced",
                "4": "2 tablespoons olive oil",
                "5": "2 tablespoons filtered water",
                "6": "2 tablespoons hemp seeds",
                "7": "1 tablespoon grated fresh lemon zest",
                "8": "Juice of 1 lemon",
                "9": "Pinch of sea salt",
                "10": "Freshly ground black pepper",
                "11": "3 cups finely grated zucchini",
                "12": "1–2 teaspoons sea salt",
                "13": "1/2 cup almond flour",
                "14": "2 tablespoons brown rice flour",
                "15": "2 eggs, beaten",
                "16": "2 cloves garlic, minced",
                "17": "2 tablespoons nutritional yeast",
                "18": "1 teaspoon dried oregano",
                "19": "1/2 teaspoon red pepper flakes",
                "20": "Freshly ground black pepper",
                "21": "Olive oil, for drizzling",
                "22": "Garnishes: arugula, grated fresh lemon zest, fresh lemon juice, and freshly ground black pepper"
            },
            "Instructions": "Quick-thaw the peas by blanching in boiling water for 3 minutes or microwaving until soft. In a food processor or high-speed blender, combine the peas, pine nuts, garlic, oil, water, hemp seeds, lemon zest, lemon juice, salt, and pepper to taste and pulse until the mixture is well combined and thick. Adjust seasonings to taste. Store in an airtight glass container in the refrigerator for up to 1 week.\nPlace the grated zucchini in a strainer, sprinkle the salt on top, and gently toss until the salt is distributed. Allow the zucchini to sit and sweat excess moisture for 45 to 60 minutes.\nTransfer the zucchini from the strainer to a nut-milk bag or cheesecloth. Wrapping the cloth around the zucchini entirely, use your hands to squeeze out any excess liquid. Repeat the process until the zucchini no longer releases liquid. Place the zucchini in a large bowl and add the flours, eggs, garlic, nutritional yeast, oregano, red pepper flakes, and black pepper to taste. Stir to combine well.\nPosition one rack in the middle of the oven and another in the top position. Place a pizza stone (for a crispier crust) or a baking sheet lined with parchment paper on the middle rack. Preheat the oven to 500ºF. Place a large piece of parchment paper on a clean countertop and drizzle it with olive oil. Spread the zucchini dough onto the parchment paper and form the dough into a large 10-inch round or oval, about 1/2 inch thick.\nTransfer the dough from the parchment paper directly to the hot pizza stone or lined baking sheet and bake for 20 minutes. Flip the pizza crust over and bake for an additional 10 minutes, until the crust is firm-crisp.\nCarefully remove the crust from the oven, spoon on the pesto to the desired thickness, and bake on the top rack for 5 to 7 minutes, until the pesto is warm. Remove from the oven. Top with garnishes, if desired, and serve immediately.",
            "Image": "//20fix.com/xfood/img/zucchini-pizza-crust-with-lemony-pea-pesto.jpg"
        },
        {
            "id": "2681",
            "Title": "Spicy Lamb Pizza With Parsley–Red Onion Salad",
            "Ingredients": {
                "1": "2 garlic cloves, finely grated",
                "2": "1/4 cup tomato paste",
                "3": "3/4 teaspoon ground cinnamon",
                "4": "3/4 teaspoon ground cumin",
                "5": "3/4 teaspoon smoked paprika",
                "6": "3/4 teaspoon kosher salt, plus more",
                "7": "12 ounces ground lamb",
                "8": "All-purpose flour (for dusting)",
                "9": "8 ounces prepared pizza dough, cut in half, room temperature",
                "10": "2 tablespoons olive oil, divided, plus more for drizzling",
                "11": "1/2 small red onion, thinly sliced",
                "12": "1 cup parsley leaves with tender stems",
                "13": "1 tablespoon fresh lemon juice",
                "14": "Crushed red pepper flakes (for serving)"
            },
            "Instructions": "Place a baking sheet on a rack in lower third of oven; preheat to 500°F. Mix garlic, tomato paste, cinnamon, cumin, paprika, and 3/4 tsp. salt in a large bowl. Mix in lamb.\nWorking with 1 piece of dough and keeping remaining piece covered, gently stretch dough into a 10x8\" oval and transfer to a lightly floured parchment-lined baking sheet. (If dough springs back, cover and let rest 10 minutes, then stretch again, resting as needed.) Crumble half of the lamb mixture over dough and brush edges with 1 Tbsp. oil. Slide onto preheated baking sheet and bake until crust is golden brown, 6–8 minutes. Transfer pizza to a wire rack. Repeat with remaining dough, lamb mixture, and 1 Tbsp. oil. Drizzle pizzas with more oil.\nToss onion, parsley, and lemon juice in a bowl; season with salt. Scatter over pizzas; sprinkle with red pepper flakes.",
            "Image": "//20fix.com/xfood/img/spicy-lamb-pizza-with-parsleyred-onion-salad.jpg"
        },
        {
            "id": "567",
            "Title": "Tomato Fried Rice",
            "Ingredients": {
                "1": "4 scallions",
                "2": "1 lb. cherry and/or grape tomatoes of any and all colors",
                "3": "Kosher salt",
                "4": "2 Tbsp. toasted sesame oil, divided",
                "5": "3 garlic cloves, finely grated",
                "6": "1 1/2 tsp. finely grated peeled ginger",
                "7": "2 1/2 cups chilled cooked long-grain white or brown rice",
                "8": "3 large eggs, beaten to blend",
                "9": "1 Tbsp. soy sauce",
                "10": "Extra-virgin olive oil (for drizzling)",
                "11": "Crushed red pepper flakes (for serving; optional)",
                "12": "1/2 lemon"
            },
            "Instructions": "Trim dark green tops from scallions and thinly slice; set aside. Thinly slice white and pale green parts; set aside separately. Quarter any larger tomatoes and halve any small ones. Place about one-quarter of tomatoes in a small bowl; season generously with salt and toss to combine. Set aside.\nHeat 1 Tbsp. sesame oil in a large skillet over medium-high. Add reserved white and pale green parts of scallions and remaining 3/4 of tomatoes and cook, stirring occasionally, until softened and any liquid from tomatoes has evaporated, about 4 minutes. Mix in garlic and ginger; cook, stirring constantly, until fragrant, about 30 seconds. Add rice and stir to separate grains. Cook just to heat rice through, about 3 minutes.\nScoot vegetables and rice to 1 side of skillet, then pour half of remaining sesame oil into pan. Add eggs and cook, stirring often, until just set, about 1 minute. Mix into vegetables and rice, then drizzle in soy sauce and cook, stirring, just until well combined.\nTransfer fried rice to a large bowl or platter. Drain salted tomatoes, drizzle with olive oil, and spoon over rice. Sprinkle with reserved scallion tops and red pepper flakes (if using) and drizzle with remaining sesame oil. Finely grate zest from lemon over.",
            "Image": "//20fix.com/xfood/img/tomato-fried-rice.jpg"
        },
        {
            "id": "2729",
            "Title": "Food Processor Pizza Dough",
            "Ingredients": {
                "1": "3/4 teaspoon active dry yeast",
                "2": "1/2 teaspoon fine sea salt",
                "3": "1 2/3 cups bread flour, plus more for surface"
            },
            "Instructions": "Pulse yeast, salt, and 1 2/3 cups flour in a food processor until combined. With the motor running, add 3/4 cup 100°F–110°F water and process until a ball forms, about 30 seconds.\nTurn dough out onto a lightly floured work surface; it should look slightly shaggy and stick to the counter (if dough is too dry, add more warm water by the teaspoonful until tacky). Knead until dough becomes smooth and elastic, about 5 minutes. Divide into 2 balls (each will make a 12–14\" pizza).\nTransfer balls to separate large resealable containers or bags. Chill at least overnight and up to 2 days.\nDough can be made 3 months ahead; tightly wrap balls in plastic and freeze.",
            "Image": "//20fix.com/xfood/img/food-processor-pizza-dough.jpg"
        },
        {
            "id": "164",
            "Title": "Very Red Velvet Cake With Cream Cheese Icing and Pecans",
            "Ingredients": {
                "1": "2½ cups cake flour",
                "2": "½ teaspoon baking soda",
                "3": "2 large eggs, at room temperature",
                "4": "1½ cups sugar",
                "5": "1½ cups vegetable oil",
                "6": "2 tablespoons distilled white vinegar",
                "7": "1 cup buttermilk",
                "8": "1 teaspoon pure vanilla extract",
                "9": "3 tablespoons red food coloring (from two 1-ounce bottles)",
                "10": "1 (1-pound) box confectioners’ sugar, sifted",
                "11": "1 (8-ounce) package cream cheese, softened",
                "12": "1 stick (8 tablespoons) butter, softened",
                "13": "1 cup chopped pecans"
            },
            "Instructions": "To make the cake: Set the oven to 350°F and adjust the rack positions to the middle and top third. Spray three 8-inch round cake pans well with baking spray.\nSift the flour with the baking soda.\nIn a large bowl, with an electric mixer on medium speed, beat the eggs well, then beat in the sugar, oil, and vinegar. On low speed, slowly add the flour and beat in well. Add the buttermilk slowly, then the vanilla, and then the food coloring.\nPour the batter evenly into the pans and rap them on the countertop several times to eliminate any air bubbles. Bake for 12 minutes, then rotate the pans from shelf to shelf so they bake evenly and bake until the tops spring back when lightly touched, about 25 minutes altogether. Let the cakes cool in the pans on racks for 15 minutes.\nRun a knife around the sides of the pans and invert the cakes onto the racks to cool completely. Once they’re cool, refrigerate the cakes for 20 to 30 minutes to make icing them easier.\nTo make the icing: Combine everything in a medium bowl and mix well until very smooth. It’s best to use the icing right away, when it’s soft and spreadable.\nPut one cake layer upside down on a cake plate or cake stand and cover the top evenly with frosting. Add a second layer, right side up, and spread with more frosting. Top with the third layer, right side up, and spread the frosting evenly around the sides of the cake and on top; check for any places where you can see through to the cake. Finally, sprinkle the pecans evenly all over the top of the cake.\nOnce the frosting sets, cut into slices to serve. This cake keeps for up to 2 weeks in a cake keeper, but once it’s ready, people want to dive right in.",
            "Image": "//20fix.com/xfood/img/very-red-velvet-cake-with-cream-cheese-icing-and-pecans.jpg"
        },
        {
            "id": "228",
            "Title": "Whipped Cream Cake",
            "Ingredients": {
                "1": "2 1/4 cups cake flour or 2 cups all purpose flour, sifted (measured by sifting into the cup and leveling it off)",
                "2": "2 teaspoons baking powder",
                "3": "3/4 teaspoon salt",
                "4": "1 1/2 cups heavy cream, cold",
                "5": "3 large eggs, at room temperature",
                "6": "1 teaspoon pure vanilla extract",
                "7": "1 cup plus 2 tablespoons superfine sugar",
                "8": "Special Equipment: 1 (10-cup) fluted metal tube pan, coated with baking spray with flour"
            },
            "Instructions": "Twenty minutes or more before baking, set an oven rack in the lower third of the oven and preheat the oven to 375°F (350°F if using a dark pan).\nIn a medium bowl, whisk together the cake flour, baking powder, and salt and then sift them together to make the mixture easier to incorporate.\nIn the bowl of a stand mixer fitted with the whisk beater, whip the cream, starting on low speed, gradually raising the speed to medium-high as it thickens, until stiff peaks form when the beater is raised.\nIn a medium bowl, whisk the eggs and vanilla just until lightly combined.\nOn medium-high speed, gradually beat the egg mixture into the whipped cream. The mixture will thicken into mayonnaise consistency (unless high-butterfat cream is used). Gradually beat in the sugar. It should take about 30 seconds to incorporate it.\nDetach the bowl and whisk beater from the stand. Add half the flour mixture to the cream mixture and, with the whisk attachment stir and fold in the flour until most of it disappears. Add the rest of the flour mixture and continue folding and mixing until all traces of flour have disappeared. Using a silicone spatula or spoon, scrape the batter into the prepared pan. Run a small metal spatula or dull knife blade through the batter to prevent large air bubbles, avoiding the bottom of the pan. Smooth the surface evenly with a small metal spatula.\nBake for 25 to 35 minutes, or until a wooden toothpick inserted between the tube and the side comes out completely clean and the cake springs back when pressed lightly in the center. The cake should start to shrink from the sides of the pan only after removal from the oven.\nLet the cake cool in the pan on a wire rack for 10 minutes. With a small metal spatula, loosen the top edges of the cake and invert the cake onto a wire rack that has been coated lightly with nonstick cooking spray. Cool completely. The cake requires no adornment, but I love to serve it with a light dusting of powdered sugar or a large dollop of lightly sweetened Whipped Cream.",
            "Image": "//20fix.com/xfood/img/whipped-cream-cake-rose-levy-beranbaum.jpg"
        },
        {
        "id": "451",
        "Title": "Christmas Cake",
        "Ingredients": {
            "1": "3 cups (450g) raisins",
            "2": "1 1⁄2 cups (240g) golden raisins",
            "3": "1 cup (160g) dried currants",
            "4": "8 soft fresh dates (160g), pitted and chopped",
            "5": "1 cup (140g) slivered almonds",
            "6": "3/4 cup (180ml) brandy",
            "7": "250g unsalted butter, softened",
            "8": "1 1/4 cups (220g) light brown sugar",
            "9": "4 eggs",
            "10": "2 1/4 cups (335g) plain (all-purpose) flour, sifted",
            "11": "1/4 teaspoon bicarbonate of (baking) soda",
            "12": "1 1/2 teaspoons ground cinnamon",
            "13": "1 teaspoon ground allspice",
            "14": "2–3 tablespoons brandy, extra"
        },
        "Instructions": "Place both raisins, currants, dates and almonds in a large bowl. Add the brandy, mix to combine and cover with plastic wrap. Allow to soak in a cool dark place overnight, mixing occasionally.\nPreheat oven to 140°C (275°F). Line a 20cm (8-inch) square cake tin with 2 layers of non-stick baking paper. Place the butter and sugar in the bowl of an electric mixer and beat on medium speed for 8 minutes or until pale and creamy. Add the eggs, 1 at a time, beating well after each addition. Set aside.\nAdd the flour, baking soda, cinnamon and allspice to the soaked fruit and mix well, ensuring the fruit is evenly coated with flour. Add the butter mixture and stir until well combined. Spoon into the tin and smooth the top. Bake for 2 hours or until cooked when tested with a skewer.\nSpoon over the extra brandy while the cake is still warm. Allow to cool completely in the tin, before turning out onto a cake stand or plate to serve.\nKeep this cake in an airtight container in a cool, dark place for up to 2 months.",
        "Image": "//20fix.com/xfood/img/christmas-fruit-cake.jpg"
    },
        {
            "id": "3491",
            "Title": "BBQ Chicken French Bread Pizzas with Smoked Mozzarella",
            "Ingredients": {
                "1": "2 teaspoons vegetable oil",
                "2": "1 medium yellow onion, thinly sliced",
                "3": "1 (12–14\") soft loaf French or Italian bread, split in half lengthwise",
                "4": "1 garlic clove, smashed",
                "5": "2 cups shredded rotisserie chicken",
                "6": "1/2 cup plus 2 tablespoons barbecue sauce, divided",
                "7": "3/4 cup coarsely grated smoked mozzarella (about 3 ounces)",
                "8": "3 tablespoons coarsely chopped fresh cilantro"
            },
            "Instructions": "Position rack in top third of oven and preheat to 425°F. Heat oil over low in a medium skillet. Cook onion, stirring occasionally, until soft and translucent, about 10 minutes. Set aside.\nPlace bread, cut side up, on a rimmed baking sheet and bake 5 minutes. Remove from oven and rub cut sides with garlic.\nToss chicken with 1/4 cup barbecue sauce in a medium bowl. Spread remaining 6 Tbsp. sauce on cut sides of bread. Layer reserved onions on sauce, then top with chicken mixture and mozzarella.\nBake until cheese is melted and golden brown, about 10 minutes. Top with cilantro.",
            "Image": "//20fix.com/xfood/img/bbq-chicken-french-bread-pizzas-with-smoked-mozzarella-56390009.jpg"
        }
    ],
    "t": 99,
    "p": {
        "limitstart": 0,
        "limit": 25,
        "total": 99,
        "pagesStart": 1,
        "pagesStop": 4,
        "pagesCurrent": 1,
        "pagesTotal": 4
    }
}