{
    "s": 1,
    "d": [
        {
            "id": "279",
            "Title": "French Canadian",
            "Ingredients": {
                "1": "2 to 2 ¼ ounces Cognac",
                "2": "¼ ounce Champagne vinegar",
                "3": "¼ ounce maple syrup",
                "4": "¼ teaspoon pure vanilla extract",
                "5": "Garnish: lemon twist"
            },
            "Instructions": "Combine Cognac, vinegar, maple syrup, and vanilla in a mixing glass and fill with ice. Stir until well chilled, about 30 revolutions. Strain into a chilled coupe glass, gently squeeze the lemon twist over the top to express oils, then use as a garnish.",
            "Image": "//20fix.com/xfood/img/french-canadian-cocktail-cognac-pantry.jpg"
        },
        {
            "id": "359",
            "Title": "Bitter French",
            "Ingredients": {
                "1": "1 ounce Plymouth gin",
                "2": "1⁄4 ounce Campari",
                "3": "1⁄2 ounce fresh lemon juice",
                "4": "1⁄2 ounce simple syrup (1:1 sugar:water)",
                "5": "Champagne",
                "6": "Garnish: 1 grapefruit twist"
            },
            "Instructions": "Shake the gin, Campari, lemon juice, and simple syrup with ice, then strain into a chilled champagne flute. Top with champagne. Squeeze the grapefruit twist over the drink, then discard.",
            "Image": "//20fix.com/xfood/img/bitter-french-cocktail-champagne-campari-gin.jpg"
        },
        {
            "id": "1327",
            "Title": "Coconut Milk French Toast with Pineapple Syrup",
            "Ingredients": {
                "1": "8 (1\"-thick) slices challah, brioche, or other rich, dense bread",
                "2": "1 (20-oz.) can cubed pineapple in juice",
                "3": "2 Tbsp. virgin coconut oil, divided, plus more for brushing",
                "4": "1 cup plus 1 Tbsp. sugar, divided",
                "5": "1/2 tsp. kosher salt, divided",
                "6": "1 (14-oz.) can coconut milk, preferably full-fat",
                "7": "1 tsp. vanilla extract"
            },
            "Instructions": "Preheat oven to 275°F. Arrange bread on a rimmed baking sheet and toast, flipping once halfway through, until dry but not browned, 20–30 minutes. This will help the bread absorb the coconut milk without sogging out.\nWhile bread toasts, drain pineapple cubes, reserving juice. Heat 1 Tbsp. oil in a medium skillet over medium. Cook pineapple, stirring occasionally, until golden brown, about 10 minutes. Add juice, 1 cup sugar, 1/4 tsp. salt, and 1/2 cup water and bring to a boil. Reduce heat to medium-low and simmer, stirring occasionally, until pineapple breaks down a little and juice is syrupy and thick, 10–12 minutes. Transfer to a medium bowl and cover with a kitchen towel to keep warm.\nWhisk coconut milk, vanilla, and remaining 1 Tbsp. sugar and 1/4 tsp. salt in a large bowl.\nHeat 1 Tbsp. oil in a nonstick skillet over medium-high. Working in batches, dip each slice of bread into coconut milk mixture and let soak about 15 seconds. Flip and soak 15 more seconds. Cook, flipping halfway through, until golden brown on each side, 3–4 minutes per side. Repeat with remaining bread, brushing skillet with more oil between batches.\nArrange toast on a platter. Top with pineapple pieces and syrup.",
            "Image": "//20fix.com/xfood/img/coconut-milk-french-toast-with-pineapple-syrup.jpg"
        },
        {
            "id": "1503",
            "Title": "Hot Chocolate Baked French Toast",
            "Ingredients": {
                "1": "Unsalted butter (for pan)",
                "2": "1 (1-pound) loaf country-style or \"peasant\" white bread, sliced 1/4\"-thick",
                "3": "3 cups heavy cream",
                "4": "6 ounces milk chocolate, coarsely chopped",
                "5": "6 ounces semisweet chocolate, coarsely chopped",
                "6": "1 tablespoon vanilla extract",
                "7": "9 large eggs",
                "8": "2 cups whole milk",
                "9": "1 cup sugar",
                "10": "1 1/4 teaspoons kosher salt",
                "11": "1/2 cup hazelnuts, coarsely chopped"
            },
            "Instructions": "Butter a 13x9\" baking dish. Arrange bread slices in overlapping rows in dish.\nCook cream, milk chocolate, semisweet chocolate, and vanilla in a medium saucepan over medium heat, whisking constantly, until chocolate is melted, about 5 minutes; remove from heat. Transfer 1 cup chocolate mixture to an airtight container; let cool to room temperature, then cover and chill until ready to serve. Reserve remaining chocolate mixture.\nWhisk eggs, milk, sugar, and salt in a large bowl. Whisking constantly, pour in hot chocolate mixture in a slow, steady stream. Pour evenly over and between each layer of bread. Push down with your hands to soak top of bread. Cover dish tightly with foil and chill at least 2 hours.\nPreheat oven to 350°F. Bake foil-covered bread until warmed through and a knife inserted into the center feels warm to the touch, about 35 minutes. Remove foil and continue baking until bread is browned, 35–40 minutes longer. Let cool 10 minutes.\nMeanwhile, toast hazelnuts in a small skillet over medium heat, tossing occasionally, until golden-brown and fragrant, 3–5 minutes. Microwave 1 cup reserved chocolate mixture in a microwave-safe bowl in 10-second intervals (or heat in a heatproof bowl set over a saucepan of simmering water), stirring occasionally, until warmed through.\nServe French toast with hot chocolate sauce and toasted hazelnuts.\nFrench toast can be assembled 1 day ahead before baking; cover tightly with foil and chill.",
            "Image": "//20fix.com/xfood/img/hot-chocolate-baked-french-toast.jpg"
        },
        {
            "id": "1547",
            "Title": "French's Green Bean Casserole",
            "Ingredients": [
                "[\"1 can (10 1/2 oz.) Campbell's® Condensed Cream of Mushroom Soup\", '3/4 cup milk",
                "1/8 tsp. black pepper",
                "4 cups cooked cut green beans or 2 cans (14.5oz each) any style Del Monte® Green Beans, drained', \"1 1/3 cups French's® Crispy Fried Onions, divided\"]"
            ],
            "Instructions": "Mix soup, milk, and pepper in a 1 1/2 -qt. baking dish. Stir in beans and 2/3 cup Crispy Fried Onions.\nBake at 350°F for 30 min. or until hot. Stir.\nTop with remaining 2/3 cup onions. Bake 5 min. until onions are golden.\nThis recipe is made available as a courtesy by The French's Food Company LLC.",
            "Image": "//20fix.com/xfood/img/frenchs-green-bean-casserole.jpg"
        },
        {
            "id": "1608",
            "Title": "French Chicken Tarragon",
            "Ingredients": {
                "1": "6 large chicken thighs (about 3 pounds)",
                "2": "Salt and pepper",
                "3": "2 tablespoons unsalted butter",
                "4": "2 shallots, finely diced",
                "5": "2 garlic cloves, grated or minced",
                "6": "2 teaspoons chopped tarragon, plus whole leaves for garnish",
                "7": "1 cup Blond Chicken Broth",
                "8": "1/2 cup dry white wine",
                "9": "1/2 cup crème fraîche",
                "10": "1/2 teaspoon grated lemon zest"
            },
            "Instructions": "Season the chicken generously with salt and pepper. Let stand for 30 minutes to 1 hour at room temperature.\nHeat the oven to 400°F. Put an enameled cast-iron Dutch oven over medium heat. Add the butter and shallots and cook, stirring, until softened and lightly browned, about 5 minutes. Add the garlic and chopped tarragon and cook for 1 minute (be careful not to let the garlic brown). Arrange the chicken thighs in the pot in one layer, add the broth and wine, and bring to a simmer.\nPut the lid on and place the pot on the middle shelf of the oven. Bake for 15 minutes, then lower the heat to 350°F and continue baking for 45 minutes, or until the thighs are tender. Put the thighs on a platter, cover loosely, and keep warm.\nStrain the pan juices through a fine sieve into a saucepan and spoon off any rising fat. Place the pan over medium-high heat, add the crème fraîche and lemon zest, and simmer until the sauce is slightly thickened, about 5 minutes. Taste and adjust the seasoning.\nSpoon the sauce over the chicken, garnish with tarragon leaves, and serve.",
            "Image": "//20fix.com/xfood/img/french-chicken-tarragon.jpg"
        },
        {
            "id": "1713",
            "Title": "French Buttercream",
            "Ingredients": {
                "1": "1 cup water",
                "2": "2 cups sugar",
                "3": "2 tablespoons corn syrup",
                "4": "1/4 teaspoon cream of tartar",
                "5": "5 egg yolks",
                "6": "1 whole egg",
                "7": "1/8 teaspoon xanthan gum",
                "8": "1 1/2 pounds cold butter, preferably European"
            },
            "Instructions": "In a heavy nonreactive saucepan, add water, then add sugar, corn syrup, and cream of tartar. The last 2 help keep the sugar from crystallizing. (Candy thermometer. Non-negotiable!)\nPut the pot on high heat. It's going to be there for a while. Be patient and keep your eye on it. Don't go walking away and watching TV or something.\nPut yolks and eggs in a stand mixer with the whisk attachment and turn to high. Just let it go! Eggs will triple in volume and go to \"ribbons stage.\" You can't overwhip!\nWait on the sugar—looking for 230°F, aka \"soft ball.\" When it happens, be ready to move quickly. Turn off the mixer and add the xanthan gum, turn back up to medium.\nRemove the thermometer from hot sugar. Lift with two hands. Rest the lip of the saucepan on the edge of the mixer bowl.\nSlowly tilt and pour sugar in a sloooow steady stream down the side of the bowl. Don't go too fast! If you do there will be chunks of scrambled eggs in your buttercream.\nOnce sugar is all in, turn the mixer to high. Beat until cool. Gauge this by putting the inside of your wrist to the outside of the bowl. It's more accurate than your hands. Switch out the whisk for the paddle. Next we're adding the butter. It's too heavy for the whisk and you'll end up breaking your stand mixer if you stay with the whisk.\nStart cutting the butter into thin pieces—you could shave it with a cheese slicer if you'd like. Add butter piece by piece—pain in the derriere, yes, but we're making an emulsion.\nSee, if you dump all the butter in at once, the butter and eggs will never combine properly, and you'll have a \"broken\" buttercream. You'll be able to identify this easily—it'll be a chunky, watery, hot mess.\nIf your buttercream does break, you can fix it! Turn to medium high, then add a little more butter, piece by piece, until fixed. Or try adding a little guar gum! This is very strong, so add a pinch and beat for a minute, then check.\nOnce your butter is added, turn the mixer to medium high to add some air—10, 20 seconds at most. Quelle Magnifique! It should be fluffy and make you want to eat it with your fingers.\nOnce you have your base, there's so many ways to flavor it! Coffee powder! Vanilla beans! Dutch cocoa! Peanut butter! Caramel! Ham! Ok, maybe not ham. Party pooper.\nCongratulations! You did it! You made French buttercream! You are a god amongst men!\nFin",
            "Image": "//20fix.com/xfood/img/french-buttercream-51196420.jpg"
        },
        {
            "id": "2035",
            "Title": "Banana-Stuffed French Toast",
            "Ingredients": {
                "1": "1 firm, ripe banana",
                "2": "3/4 cup half-and-half",
                "3": "2 large eggs",
                "4": "1 teaspoon vanilla",
                "5": "1/4 teaspoon cinnamon",
                "6": "1/4 teaspoon freshly grated nutmeg",
                "7": "four 1-inch-thick slices day-old challah or brioche",
                "8": "2 tablespoons unsalted butter', \"confectioners' sugar for dusting\", 'Accompaniment: warm maple syrup"
            },
            "Instructions": "Preheat oven to 350° F.\nCut banana into 1/4-inch-thick slices and in a bowl whisk together half-and-half, eggs, vanilla, cinnamon, and nutmeg. Cut bread slices horizontally almost in half, leaving 1 edge intact. Stuff each pocket with 4 to 6 banana slices (do not overstuff). In a baking dish just large enough to hold bread slices in one layer, arrange slices and pour custard over them. Soak slices, turning them over once or twice to allow bread to absorb all liquid, about 15 minutes.\nIn a 12-inch non-stick skillet melt butter over low heat until foam subsides and cook slices until golden, about 5 minutes on each side.\nDust French toast with confectioners' sugar and serve with syrup.",
            "Image": "//20fix.com/xfood/img/banana-stuffed-french-toast-14951.jpg"
        },
        {
            "id": "2046",
            "Title": "Buttered-Pecan French Toast with Bourbon Maple Syrup",
            "Ingredients": {
                "1": "1 heaping cup pecan halves, coarsely chopped",
                "2": "3 tablespoons unsalted butter",
                "3": "1 teaspoon sugar",
                "4": "1/2 teaspoon salt",
                "5": "5 large eggs",
                "6": "1 cup whole milk",
                "7": "1/2 cup heavy cream",
                "8": "3 tablespoons lightly packed light brown sugar",
                "9": "1/2 teaspoon ground cinnamon",
                "10": "1/4 teaspoon salt",
                "11": "2 teaspoons pure vanilla extract",
                "12": "8 thick slices brioche",
                "13": "4 tablespoons clarified butter, for the pan",
                "14": "1 cup pure maple syrup",
                "15": "2 tablespoons bourbon",
                "16": "Dash of pure vanilla extract",
                "17": "Confectioners’ sugar, for serving"
            },
            "Instructions": "Place a rack in the upper third of the oven and preheat to 350°F.\nPlace the pecan pieces on a rimmed baking sheet and toast for 10 to 14 minutes, until fragrant and golden brown. Remove from the oven and reduce the oven temperature to 200°F.\nIn a medium sauté pan set over medium heat, melt the butter. Stir in the sugar and salt. Add the pecans and cook, stirring, for 3 to 4 minutes, until the butter is lightly browned. Remove the pan from the heat.\nIn a medium bowl, whisk together the eggs and milk.\nIn a small saucepan set over medium heat, warm the heavy cream for about 3 minutes, until just steaming and remove from the heat.\nIn a small bowl, combine the brown sugar, cinnamon, and salt. Add the sugar mixture to the cream and stir just until the sugar is dissolved. Add the cream mixture to the egg and milk mixture. Stir in the vanilla.\nWorking with one slice of bread at a time, put a slice into the egg mixture and let it soak for about 15 seconds on each side. Place on a rimmed baking sheet to rest while all the bread is dipped and the pan is heated.\nIn a medium nonstick skillet or griddle pan set over medium heat, melt the clarified butter. Place 2 or 3 bread slices into the pan and cook for about 2 minutes per side, until golden brown on each side. Add a bit more butter to the pan after you flip the bread, if needed. Transfer to a heatproof plate or rimmed baking sheet with a wire cooling rack set inside. Cover with a kitchen towel and keep warm in the oven while you cook the rest of the toast. Repeat the cooking process with the remaining bread.\nIn a small saucepan set over low heat, gently stir together the maple syrup, bourbon, and vanilla until just warmed and well combined.\nTo serve, place 2 slices of French toast on each plate. Generously sprinkle with buttered pecans, drizzle with syrup, and dust with confectioners’ sugar. Serve immediately.",
            "Image": "//20fix.com/xfood/img/buttered-pecan-french-toast-with-bourbon-maple-syrup.jpg"
        },
        {
            "id": "2281",
            "Title": "Stuffed French Toast With Almond Butter and Banana",
            "Ingredients": {
                "1": "2 slices of rye or wholegrain bread",
                "2": "2 tbsp almond butter",
                "3": "1/2 banana, thinly sliced",
                "4": "1 free-range egg",
                "5": "1/2 tsp ground cinnamon",
                "6": "50ml (about 1/4 cup) unsweetened almond milk",
                "7": "Coconut oil, for frying",
                "8": "Fresh berries and Greek yogurt, to serve (optional)"
            },
            "Instructions": "Slice the bread into halves and layer up the bottom halves with your almond butter and banana slices, then sandwich together with the top half.\nIn a shallow dish, whisk together the egg, cinnamon and almond milk until fully combined, then soak both sides of your sandwiches until well coated and moist.\nHeat a little coconut oil in a non-stick frying pan then gently lay your sandwiches in to fry for about 4 minutes on each side.\nPlate up and top with fresh berries and a tablespoon of Greek yogurt, if you like.",
            "Image": "//20fix.com/xfood/img/stuffed-french-toast-with-almond-butter-and-banana.jpg"
        },
        {
            "id": "2813",
            "Title": "Diner-Style French Toast",
            "Ingredients": {
                "1": "3 large eggs",
                "2": "1 1/4 cups whole milk",
                "3": "1 teaspoon granulated sugar",
                "4": "1 teaspoon vanilla extract",
                "5": "3/4 teaspoon cinnamon",
                "6": "1/2 teaspoon kosher salt",
                "7": "4 teaspoons vegetable oil, divided",
                "8": "4 tablespoons unsalted butter, softened, divided",
                "9": "8 (3/4–inch-thick) slices challah or other rich, dense bread",
                "10": "Powdered sugar and maple syrup (for serving)"
            },
            "Instructions": "Whisk eggs, milk, granulated sugar, vanilla, cinnamon, and salt in a large bowl.\nHeat a large griddle or 2 cast-iron or nonstick skillets over medium. Brush with a thin coating of oil, then a thin coating of butter.\nWorking in batches, dip each slice of bread into egg mixture. Cook, flipping halfway through, until golden brown on each side, about 2 minutes per side. Repeat with remaining bread, brushing griddle with remaining oil and butter as needed. Dust French toast with powdered sugar just before serving. Serve with maple syrup alongside.",
            "Image": "//20fix.com/xfood/img/diner-style-french-toast.jpg"
        },
        {
            "id": "2906",
            "Title": "3-Ingredient Ice Cream French Toast",
            "Ingredients": {
                "1": "1 pint vanilla ice cream (not gelato), melted",
                "2": "4 (1–1 1/2\"-thick) slices challah or brioche",
                "3": "5 tablespoons unsalted butter, divided"
            },
            "Instructions": "Preheat oven to 250°F. Pour ice cream into a large baking dish. Add bread, turn to coat, then let sit 3 minutes. Flip bread and continue to soak until saturated but not soggy, about 3 minutes more.\nHeat 2 Tbsp. butter in a large skillet over medium. Using tongs, carefully lift 2 bread slices from custard, letting excess drip back into dish. Transfer to skillet in a single layer and cook until golden brown and the center of toast springs back when pressed, about 4 minutes per side. Transfer to a wire rack set inside a rimmed baking sheet; keep warm in oven until ready to serve. Repeat with 2 Tbsp. butter and remaining bread. Top toasts with remaining 1 Tbsp. butter and serve.",
            "Image": "//20fix.com/xfood/img/3-ingredient-ice-cream-french-toast.jpg"
        },
        {
            "id": "2922",
            "Title": "French 75",
            "Ingredients": {
                "1": "2 ounces London dry gin",
                "2": "3/4 ounce fresh lemon juice",
                "3": "3/4 ounce simple syrup",
                "4": "2 ounces Champagne",
                "5": "Long spiral lemon twist (for serving)"
            },
            "Instructions": "Combine gin, lemon juice, and simple syrup in a cocktail shaker. Fill shaker with ice, cover, and shake vigorously until outside of shaker is very cold, about 20 seconds.\nStrain cocktail through a Hawthorne strainer or a slotted spoon into a large flute. Top with Champagne; garnish with lemon twist.",
            "Image": "//20fix.com/xfood/img/french-75-champagne-cocktail.jpg"
        },
        {
            "id": "2995",
            "Title": "French Toast Fingers With Chocolate Hazelnut Spread and Blueberries",
            "Ingredients": {
                "1": "2 cups half and half (500 mililiters)",
                "2": "1 tablespoon honey",
                "3": "1/2 ounce butter (15 grams) butter",
                "4": "Zest of 1 orange",
                "5": "1 vanilla bean, split and seeds scraped",
                "6": "4 eggs",
                "7": "5 1/2 ounces caster (superfine) sugar (150 grams)",
                "8": "1 brioche loaf",
                "9": "2 tablespoons homemade chocolate hazelnut spread",
                "10": "1 cup blueberries (9 1/2 ounces/270 grams)",
                "11": "1 1/2 fluid ounces coconut oil (50 milliliters)"
            },
            "Instructions": "Preheat oven to 325°F (175°C).\nPut the cream, honey, butter, orange zest and vanilla bean in a medium saucepan over medium-high heat. Bring to a boil, stirring, and remove from the heat.\nPut the eggs and sugar in a large bowl and whisk to combine.\nPour the hot cream mixture over the egg mixture and whisk to combine.\nUsing a bread knife, cut the crust off the brioche loaf to create a square log. Slice the loaf in half lengthways. Spread both halves with chocolate hazelnut spread, like you’re making a big sandwich, then add the blueberries to the middle and close the sandwich.\nSoak the brioche loaf in the warm egg custard for 10 minutes, or until it’s well soaked.\nPut coconut oil in a medium pan over medium heat and cook the brioche loaf until it’s golden brown all over, then finish in the oven for 5 minutes. Transfer to a plate lined with paper towel and slice into fingers.",
            "Image": "//20fix.com/xfood/img/french-toast-fingers-with-chocolate-hazelnut-spread-and-blueberries.jpg"
        },
        {
            "id": "3233",
            "Title": "French Spiced Bread",
            "Ingredients": {
                "1": "2 tablespoons melted unsalted butter",
                "2": "1/2 cup whole almonds",
                "3": "1/2 cup store-bought or homemade candied orange peel",
                "4": "1/2 cup dried apricots",
                "5": "1/2 cup dried plums",
                "6": "2 cups honey",
                "7": "1 1/4 cups whole milk",
                "8": "2 teaspoons kosher salt",
                "9": "6 (3\") cinnamon sticks",
                "10": "3 star anise pods",
                "11": "3 cups all-purpose flour",
                "12": "1 tablespoon plus 1 teaspoon baking powder",
                "13": "1 tablespoon plus 1 teaspoon Reims N.39 spice mix",
                "14": "2 teaspoons baking soda",
                "15": "2 large eggs",
                "16": "2 (9x5\") loaf pans"
            },
            "Instructions": "Preheat oven to 325°F. Grease loaf pans with melted butter.\nToast almonds on a rimmed baking sheet, tossing once or twice, until golden brown and fragrant, 6–8 minutes. Coarsely chop zest, apricots, plums, and toasted almonds. Transfer to a small bowl.\nBring honey, milk, salt, cinnamon, and star anise to a boil in a medium saucepan over medium heat. Meanwhile, whisk flour, baking powder, spice mix, and baking soda in a large bowl.\nStrain honey mixture through a fine-mesh sieve into dry ingredients and whisk to combine. Add eggs and whisk until incorporated. Using a spatula, quickly fold in zest mixture.\nDivide dough between prepared pans, filling each about three-quarters full. Bake bread until tops are golden brown and a toothpick inserted into the centers comes out clean, 35–40 minutes.\nLet bread cool 10 minutes in pan, then carefully remove from pan and transfer to a wire rack.\nBread can be made 5 days ahead. Tightly wrap and store at room temperature, or freeze up to 1 month.",
            "Image": "//20fix.com/xfood/img/french-spiced-bread.jpg"
        },
        {
            "id": "3235",
            "Title": "Luxe French Potatoes",
            "Ingredients": {
                "1": "4 pounds Yukon Gold potatoes, peeled, cut into 1 1/2\" pieces",
                "2": "Kosher salt",
                "3": "4 garlic cloves, forced through a press or finely chopped",
                "4": "2 cups heavy cream",
                "5": "1/2 cup (1 stick) unsalted butter",
                "6": "3/4 teaspoon freshly grated nutmeg",
                "7": "3/4 teaspoon freshly ground white pepper",
                "8": "3/4 pound Gruyère, coarsely grated (about 4 cups)",
                "9": "1/2 pound fresh mozzarella, coarsely grated (about 1 1/2 cups)",
                "10": "A 4-quart gratin or casserole dish; a potato ricer or food mill; a pastry bag fitted with a 3/4-inch star tip"
            },
            "Instructions": "Place rack in middle of oven and preheat to 350°F. Place potatoes in a large wide heavy pot. Add 1 1/2 tsp. salt and enough cold water to cover by 2\". Bring to a boil over high heat, then reduce heat to medium-low and simmer until potatoes break apart when pierced with the tip of a knife, 35–40 minutes.\nMeanwhile, cook garlic, cream, and butter in a medium saucepan over medium heat, whisking occasionally, until butter is melted. Whisk in nutmeg, pepper, and 1 Tbsp. plus 1 tsp. salt. Remove from heat.\nDrain potatoes and immediately pass through potato ricer into a large bowl. Stir in cream mixture until smooth.\nReturn half of potato mixture to wide pot; reserve remaining potato mixture in bowl. Add Gruyère and mozzarella and cook over low heat, stirring constantly with a wooden spoon, until cheese is melted and mixture can be stretched with the spoon (like warm mozzarella), about 10 minutes. Transfer to gratin dish; smooth top.\nWorking in batches if needed, spoon reserved potato mixture in bowl into pastry bag fitted with star tip. Pipe very tight rows of 1/2x1/2\" rosettes on potato-cheese mixture in gratin dish. Bake until top is golden brown, about 45 minutes. Let stand 10 minutes before serving.",
            "Image": "//20fix.com/xfood/img/luxe-french-potatoes.jpg"
        },
        {
            "id": "3312",
            "Title": "French Toast Turkey Sandwich",
            "Ingredients": {
                "1": "6 slices thick-cut bacon",
                "2": "2 tablespoons light brown sugar",
                "3": "1 teaspoon coarsely ground black pepper",
                "4": "3 large eggs",
                "5": "1 cup milk",
                "6": "1/2 teaspoon vanilla extract",
                "7": "1/4 teaspoon ground cinnamon",
                "8": "Pinch of kosher salt",
                "9": "4 slices thick country-style white bread",
                "10": "2 tablespoons unsalted butter",
                "11": "Leftover cranberry sauce, leftover sliced turkey, and arugula leaves (for serving)"
            },
            "Instructions": "Preheat oven to 400°. Sprinkle bacon with brown sugar and pepper; transfer to a wire rack set inside a foil-lined rimmed baking sheet and bake until browned and crisp, 20–25 minutes. Let cool.\nWhisk eggs, milk, vanilla, cinnamon, and salt in a large baking dish. Add bread slices and let sit, turning to coat, until bread has absorbed most of the liquid, about 5 minutes.\nMelt 1 Tbsp. butter in a large skillet over medium heat. Cook 2 slices of bread until golden brown, about 3 minutes per side. Repeat with remaining 1 Tbsp. butter and 2 slices of bread.\nAssemble sandwiches using leftover cranberry sauce, leftover turkey, arugula, and bacon, and cut in half.",
            "Image": "//20fix.com/xfood/img/french-toast-turkey-sandwich.jpg"
        },
        {
            "id": "3327",
            "Title": "Baked French Toast with Pecan Crumble",
            "Ingredients": {
                "1": "1 1-pound loaf challah, sliced 1\" thick",
                "2": "Unsalted butter, room temperature (for baking dish)",
                "3": "4 large eggs",
                "4": "4 large egg yolks",
                "5": "2 cups heavy cream",
                "6": "2 cups whole milk",
                "7": "1/2 cup sugar",
                "8": "1 teaspoon vanilla extract",
                "9": "1/2 teaspoons ground cinnamon",
                "10": "1/2 teaspoons ground nutmeg",
                "11": "1/2 teaspoons kosher salt",
                "12": "1/2 cup pecans",
                "13": "2 tablespoons chilled unsalted butter, cut into pieces",
                "14": "2 tablespoons light brown sugar",
                "15": "1/2 teaspoons kosher salt",
                "16": "Blackberry Syrup"
            },
            "Instructions": "Spread out bread on a rimmed baking sheet; let stand overnight.\nButter a 13x9\" baking dish. Cut bread so slices are similar in size. Arrange, overlapping, in rows in prepared dish.\nWhisk eggs, egg yolks, cream, milk, sugar, vanilla, cinnamon, nutmeg, and salt in a medium bowl. Pour over bread, pressing bread to help it soak up custard. Cover and chill at least 2 hours.\nPreheat oven to 375°F. Pulse pecans, butter, brown sugar, and salt in a food processor until nuts are coarsely chopped.\nScatter pecan crumble over soaked bread. Place dish on a rimmed baking sheet and cover tightly with foil. Bake until warmed through (a knife inserted into the center should feel warm to the touch), 25–30 minutes. Remove foil and bake until deeply browned, 35–40 minutes longer. Let cool slightly before serving with Blackberry Syrup.\nBread can be soaked 1 day ahead. Keep chilled. Pecan mixture can be made 1 day ahead. Cover and chill.",
            "Image": "//20fix.com/xfood/img/baked-french-toast-with-pecan-crumble-51205040.jpg"
        },
        {
            "id": "3491",
            "Title": "BBQ Chicken French Bread Pizzas with Smoked Mozzarella",
            "Ingredients": {
                "1": "2 teaspoons vegetable oil",
                "2": "1 medium yellow onion, thinly sliced",
                "3": "1 (12–14\") soft loaf French or Italian bread, split in half lengthwise",
                "4": "1 garlic clove, smashed",
                "5": "2 cups shredded rotisserie chicken",
                "6": "1/2 cup plus 2 tablespoons barbecue sauce, divided",
                "7": "3/4 cup coarsely grated smoked mozzarella (about 3 ounces)",
                "8": "3 tablespoons coarsely chopped fresh cilantro"
            },
            "Instructions": "Position rack in top third of oven and preheat to 425°F. Heat oil over low in a medium skillet. Cook onion, stirring occasionally, until soft and translucent, about 10 minutes. Set aside.\nPlace bread, cut side up, on a rimmed baking sheet and bake 5 minutes. Remove from oven and rub cut sides with garlic.\nToss chicken with 1/4 cup barbecue sauce in a medium bowl. Spread remaining 6 Tbsp. sauce on cut sides of bread. Layer reserved onions on sauce, then top with chicken mixture and mozzarella.\nBake until cheese is melted and golden brown, about 10 minutes. Top with cilantro.",
            "Image": "//20fix.com/xfood/img/bbq-chicken-french-bread-pizzas-with-smoked-mozzarella-56390009.jpg"
        },
        {
            "id": "3492",
            "Title": "French Bread Pizzas With Ricotta, Roasted Tomatoes, and Pesto",
            "Ingredients": {
                "1": "1 1/2 pints cherry tomatoes, halved (about 3 cups)",
                "2": "1 tablespoon plus 2 teaspoons olive oil, divided",
                "3": "1/4 teaspoon kosher salt, plus more to taste",
                "4": "1/4 teaspoon freshly ground black pepper, plus more to taste",
                "5": "1 (12–14\") soft loaf French or Italian bread, split in half lengthwise",
                "6": "1 garlic clove, smashed",
                "7": "1/2 cup fresh ricotta (about 5 ounces)",
                "8": "3/4 cup coarsely grated Parmesan (about 3 ounces)",
                "9": "2 tablespoons fresh store-bought or homemade basil pesto"
            },
            "Instructions": "Position rack in top third of oven and preheat to 425°F. Toss tomatoes, 1 Tbsp. oil, 1/4 tsp. salt, and 1/4 tsp. pepper on a rimmed baking sheet. Roast until tomatoes start to blister, about 13 minutes.\nPlace bread, cut side up, on another rimmed baking sheet and bake 5 minutes. Remove from oven and rub cut sides with garlic.\nDollop ricotta on cut sides of bread. Top evenly with tomato mixture, then sprinkle with Parmesan. Bake until Parmesan melts, about 10 minutes.\nWhisk pesto and remaining 2 tsp. oil in a small bowl until smooth. Drizzle on pizzas and season with salt and pepper.",
            "Image": "//20fix.com/xfood/img/french-bread-pizzas-with-ricotta-roasted-tomatoes-and-pesto-56390007.jpg"
        },
        {
            "id": "3493",
            "Title": "French Bread Pizzas with Mozzarella and Pepperoni",
            "Ingredients": {
                "1": "1 (12–14\") soft loaf French or Italian bread, split in half lengthwise",
                "2": "1 garlic clove, smashed",
                "3": "1/2 cup store-bought tomato sauce",
                "4": "1 cup coarsely grated mozzarella (about 4 ounces)",
                "5": "3 ounces sliced pepperoni",
                "6": "1/4 teaspoon crushed red-pepper flakes (optional)",
                "7": "2 tablespoons coarsely chopped fresh basil"
            },
            "Instructions": "Position rack in top third of oven and preheat to 425°F. Place bread, cut side up, on a rimmed baking sheet and bake 5 minutes. Remove from oven and rub cut sides with garlic.\nSpread tomato sauce on cut sides of bread. Top with mozzarella, pepperoni, and red-pepper flakes, if using.\nBake until cheese is melted and golden brown, about 10 minutes. Top with basil.",
            "Image": "//20fix.com/xfood/img/french-bread-pizzas-with-mozzarella-and-pepperoni-56390008.jpg"
        },
        {
            "id": "3508",
            "Title": "Petit Trois's French Onion Soup",
            "Ingredients": {
                "1": "6 pound veal neck or beef bones",
                "2": "1 tablespoon grapeseed or vegetable oil",
                "3": "2 large onions, chopped",
                "4": "6 celery stalks, chopped",
                "5": "1 pound carrots, peeled, chopped",
                "6": "1/4 cup tomato paste",
                "7": "1 head of garlic, halved crosswise",
                "8": "4 sprigs thyme",
                "9": "1 bay leaf",
                "10": "3 tablespoons grapeseed or vegetable oil",
                "11": "1 tablespoon unsalted butter",
                "12": "1 head of garlic, halved crosswise",
                "13": "4 pounds onions, thinly sliced",
                "14": "Kosher salt, freshly ground pepper",
                "15": "3 tablespoons dry Sherry",
                "16": "6 sprigs thyme",
                "17": "1 bay leaf",
                "18": "4 1/2\"-thick slices baguette, toasted",
                "19": "4 1/8\"-thick slices Gruyere",
                "20": "4 1/8\"-thick slices Emmenthal cheese",
                "21": "Cheesecloth",
                "22": "French onion soup bowls or 8-ounce ramekins"
            },
            "Instructions": "Preheat oven to 425°F. Place a wire rack inside a rimmed baking sheet and place bones on top. Roast bones (undisturbed) until deep golden brown, 40–50 minutes. Transfer to a large pot and add 5 quarts of water. Bring to a simmer, then use a fine-mesh sieve to skim off any foam or gray bits from the surface. Remove from heat.\nMeanwhile, in another large pot, heat oil over medium-high. Add onions, celery, and carrots and cook, stirring occasionally, until vegetables start to caramelize, 10–15 minutes. Add tomato paste and cook, stirring often, until slightly darkened in color, 6–8 minutes.\nAdd bones along with liquid, garlic, thyme, and bay leaf to vegetables. Bring just to a boil; reduce heat to low, and cook at a bare simmer, adding water as needed during cooking to maintain level of liquid until stock is flavorful, about 2 hours. Strain stock through a fine-mesh sieve into a large bowl, then strain again into another large bowl or airtight containers.\nStock can be made 5 days ahead. Let cool; cover and chill, or freeze up to 1 month ahead.\nHeat oil and butter in a large pot over medium heat. Place garlic, cut side down, in pot and cook undisturbed until golden brown, about 4 minutes. Transfer garlic to a plate.\nAdd onions to same pot, season with salt and pepper, and cook, stirring occasionally at first and then more often as onions darken to keep them from getting too brown in any one spot, until golden but not mushy, 60–70 minutes (and no, this process can't be rushed at a higher temperature).\nAdd Sherry and stir, scraping up any browned bits from bottom of pot. Stir in 8 cups veal stock. Bundle up garlic, thyme, and bay leaf in cheesecloth and tie closed with kitchen twine. Add to pot; bring mixture to a boil. Reduce heat and cook, stirring occasionally, until liquid is reduced by one-quarter, flavors have melded, and onions are completely tender, 45–50 minutes.\nHeat broiler. Divide soup among bowls and top each with a toast and a slice each of Gruyere and Emmenthal cheese. Place on a rimmed baking sheet and broil until cheese is melted and brown in spots, about 5 minutes. Let cool for a minute or so before serving.",
            "Image": "//20fix.com/xfood/img/petit-troiss-french-onion-soup-56389985.jpg"
        },
        {
            "id": "3509",
            "Title": "Pickled French Fries",
            "Ingredients": {
                "1": "5 tablespoons kosher salt, plus more",
                "2": "3 1/2 pound large red-skin potatoes, scrubbed, cut into 1/4\"-thick sticks",
                "3": "4 leaves Napa cabbage",
                "4": "Rice bran or grapeseed oil (for frying; about 6 cups)",
                "5": "A deep-fry thermometer"
            },
            "Instructions": "Combine 5 tablespoons salt and 8 cups water in a large bowl or pot, stirring until salt dissolves. Add potatoes and cabbage (potatoes should sink, but some of the cabbage leaves may float). Cover bowl and store in a cool, dark place (a kitchen cabinet or pantry is ideal) 4–6 days; the longer the potatoes sit, the funkier their flavor will be. Drain and pat potatoes dry; discard cabbage leaves.\nFit a large pot with thermometer and pour in oil to measure 3\" up sides of pot. Heat oil over medium-high until thermometer registers 325°F. Working in batches (you want potatoes to have room to move around), fry potatoes until cooked through and tender but not browned, about 5 minutes. Using a spider or a slotted spoon, transfer fries to paper towels to drain as they are done.\nHeat oil until thermometer registers 375°F. Working in batches again, refry potatoes until crisp (the edges may brown, but fries will mostly stay pretty light), about 1 minute per batch. Transfer to fresh paper towels to drain; sprinkle with salt (because of the brine, you won't need to add much).",
            "Image": "//20fix.com/xfood/img/pickled-french-fries-56389983.jpg"
        },
        {
            "id": "3995",
            "Title": "Our Favorite French Onion Soup",
            "Ingredients": {
                "1": "5 tablespoons unsalted butter, divided",
                "2": "1 tablespoon vegetable oil",
                "3": "3 pounds Vidalia onions (about 4 medium), halved lengthwise, peeled, and thinly sliced",
                "4": "1 teaspoon kosher salt",
                "5": "1/2 teaspoon freshly ground black pepper",
                "6": "1/2 teaspoon granulated sugar",
                "7": "1 1/2 cups dry white wine",
                "8": "6 cups homemade beef broth or store-bought low-sodium beef broth",
                "9": "10 sprigs thyme",
                "10": "2 bay leaves",
                "11": "1 baguette",
                "12": "1 garlic clove, cut in half lengthwise",
                "13": "2 teaspoons sherry, preferably Fino or Manzanilla",
                "14": "4 ounces Gruyère cheese, grated (about 1 cup)",
                "15": "kitchen twine, six 8-ounce or four 16-ounce oven-safe ramekins or bowls (optional)"
            },
            "Instructions": "In a large Dutch oven or other large pot, melt 3 tablespoons butter over medium heat. Add the oil and onions; cook onions are until softened, stirring occasionally, about 15 minutes. Add the salt, pepper, and sugar; continue to cook, stirring occasionally, until onions are deep golden brown and caramelized, reducing heat slightly if onions seem to be browning too quickly, 35 to 45 minutes more.\nAdd wine and raise heat to high. Cook until almost all liquid has evaporated, 8 to 10 minutes.\nTie thyme and bay leaves into a bundle with twine. Add broth and herb bundle to pot with onions. Bring to a boil, reduce to a simmer, and cook, uncovered, until broth is thickened and flavorful, 20 to 30 minutes. Remove from heat and whisk in remaining 2 tablespoons butter. Taste and adjust seasoning.\nHeat the broiler. Cut two 1/2-inch baguette slices for every serving of soup. Place baguette slices on a rimmed baking sheet and toast in oven until crisp and dry but not browned, about 1 minute per side. Rub one side of each toast with the garlic clove and set aside.\nPlace ramekins or ovensafe bowls on a rimmed baking sheet, add 1/2 teaspoon of sherry to the bottom of each, and ladle soup on top. Top each serving of soup with two garlic-rubbed toasts. Divide cheese among the servings, covering the bread and some of the soup. Carefully transfer baking sheet to oven and broil until cheese is melted and bubbling, 4 to 8 minutes. (Alternatively, if using regular soup bowls: Top each garlic-rubbed toast with some cheese and return to broiler to melt, about 2 minutes more. Divide sherry and soup among bowls, sprinkle with remaining cheese, and top each serving with two cheese toasts.)",
            "Image": "//20fix.com/xfood/img/our-favorite-french-onion-soup-51248680.jpg"
        },
        {
            "id": "4098",
            "Title": "French Toast on a Stick",
            "Ingredients": {
                "1": "1 cup milk",
                "2": "2 large eggs",
                "3": "1 tablespoon honey",
                "4": "1 teaspoon ground cinnamon",
                "5": "4 cups brioche, french or sandwich bread, cut into 2 inch cubes",
                "6": "1 tablespoon butter or oil",
                "7": "16 strawberries, stems removed",
                "8": "2 bananas, sliced into 1/2 inch coins",
                "9": "8 wooden skewers"
            },
            "Instructions": "In a bowl, whisk together the milk, eggs, honey and cinnamon.\nDip the bread cubes in the milk mixture to coat each side.\nHeat the butter in a skillet over medium heat and cook the bread for 1 1/2 minutes on each side, or until golden brown.\nSkewer the french toast cubes, strawberries and bananas and serve with maple syrup for dipping.",
            "Image": "//20fix.com/xfood/img/french-toast-on-a-stick-51262420.jpg"
        }
    ],
    "t": 71,
    "p": {
        "limitstart": 0,
        "limit": 25,
        "total": 71,
        "pagesStart": 1,
        "pagesStop": 3,
        "pagesCurrent": 1,
        "pagesTotal": 3
    }
}