{
    "s": 1,
    "d": [
        {
            "id": "1532",
            "Title": "Indian-Spiced Pork Roast with Rosemary and Onions",
            "Ingredients": {
                "1": "1 tablespoon black peppercorns",
                "2": "1 tablespoon fennel seeds",
                "3": "1 teaspoon cumin seeds",
                "4": "1 tablespoon crushed red pepper flakes",
                "5": "1 tablespoon paprika",
                "6": "3 tablespoons Diamond Crystal or 1 tablespoon plus 2 1/4 teaspoons Morton kosher salt, plus more",
                "7": "2 (8-bone) racks of pork (about 4 pounds each), chine bone removed, fat trimmed 1/4-inch thick, rib bones frenched",
                "8": "1/2 cup coarsely chopped rosemary leaves",
                "9": "1/2 cup plus 3 tablespoons extra-virgin olive oil",
                "10": "1 1/2 pounds medium mixed red, white, and/or yellow onions, peeled, quartered through root end",
                "11": "4 bay leaves",
                "12": "A spice mill or mortar and pestle"
            },
            "Instructions": "Toast peppercorns, fennel seeds, and cumin seeds in a dry small skillet over medium heat, tossing often, until fragrant, about 2 minutes. Let cool, then coarsely grind in spice mill or with mortar and pestle along with red pepper flakes and paprika. Transfer to a small bowl and stir in 3 Tbsp. Diamond Crystal or 1 Tbsp. plus 2 1/4 tsp. Morton kosher salt.\nPlace racks of pork on a rimmed baking sheet and pat dry. Tie racks with kitchen twine, spacing 1\" apart (make sure to tie the meat snugly; you want it to be uniform in shape so that it will cook evenly). Rub all over with spice mixture and chill, uncovered, at least 6 hours or up to 12 hours (for the best flavor, longer is better).\nLet pork sit out at room temperature about 2 hours before roasting.\nCombine rosemary and 1/2 cup oil in a small bowl; let infuse while meat is coming to room temperature.\nPlace a rack in middle of oven and preheat to 500°F. Toss onions and bay leaves with remaining 3 Tbsp. oil in a large roasting pan (they should cover the bottom of the pan); season with salt. Rub pork all over with rosemary oil and place on top of onions. Roast until top of pork is golden brown, 10–15 minutes. Reduce oven temperature to 325°F and continue roasting pork and onions until an instant-read thermometer inserted into the center of meat registers 135°F, 60–75 minutes. Transfer pork roasts to a cutting board and tent with foil. Let rest 20–30 minutes. Keep oven on.\nJust before serving, give onions a toss and heat in oven just to warm through. Slice pork roasts between rib bones to make individual chops; arrange on a platter with onions.",
            "Image": "//20fix.com/xfood/img/indian-spiced-pork-roast-with-rosemary-and-onions.jpg"
        },
        {
            "id": "2800",
            "Title": "Indian-Spiced Chicken, Eggplant, and Tomato Skewers",
            "Ingredients": {
                "1": "4 garlic cloves, finely grated",
                "2": "1 (3\") piece ginger, finely grated",
                "3": "1 (14-ounce) can coconut milk",
                "4": "3 teaspoons finely grated lime zest",
                "5": "2 tablespoons fresh lime juice",
                "6": "2 tablespoons tomato paste",
                "7": "3 teaspoons kosher salt",
                "8": "1 1/2 teaspoons ground turmeric",
                "9": "1/4 teaspoon cayenne pepper",
                "10": "1/4 teaspoon ground cardamom",
                "11": "2 pounds boneless skinless chicken thighs, trimmed, cut into 1 1/2\" cubes",
                "12": "1 medium eggplant, cut into 1 1/2\" cubes",
                "13": "1 small red onion, cut into 2\" pieces",
                "14": "1 pint cherry tomatoes",
                "15": "Canola or vegetable oil (for grill)",
                "16": "Naan or flatbread, cilantro, lime wedges, and plain yogurt (for serving)",
                "17": "14 (8–12-inch-long) metal or bamboo skewers soaked in water at least 1 hour"
            },
            "Instructions": "Whisk garlic, ginger, coconut milk, lime zest and juice, tomato paste, salt, turmeric, cayenne, and cardamom in a large bowl. Transfer half of marinade to another large bowl. Add chicken to 1 bowl of marinade; toss to coat. Add eggplant, onion, and tomatoes to the other bowl; toss to coat. Cover and chill at least 1 hour.\nThread each ingredient onto its own set of skewers: divide chicken among 6 skewers, tomatoes among 4, eggplant among 3, and onion on 1.\nPrepare a grill or grill pan for high heat; generously oil grates. Grill skewers, turning often, until well charred and cooked through, about 5 minutes for tomatoes, 10 minutes for chicken, and 15 minutes for eggplant and onion.\nJust before serving, toast naan on grill until warmed through, about 2 minutes. Top grilled chicken and vegetables with cilantro and serve with naan, lime wedges, and yogurt alongside.\nIngredients can be marinated 1 day ahead; cover and chill. Skewers can be assembled 1 day ahead; cover and chill.",
            "Image": "//20fix.com/xfood/img/indian-spiced-chicken-eggplant-and-tomato-skewers.jpg"
        },
        {
            "id": "4919",
            "Title": "Indian-Spiced Chicken With Tomato and Cream",
            "Ingredients": {
                "1": "3 tablespoons ghee (clarified butter) or vegetable oil",
                "2": "6 chicken legs (drumsticks with thighs; about 3 pounds)",
                "3": "Kosher salt",
                "4": "freshly ground pepper",
                "5": "1 medium onion, finely chopped",
                "6": "4 garlic cloves, finely grated",
                "7": "2 tablespoons finely grated peeled ginger",
                "8": "2 tablespoons tomato paste",
                "9": "2 teaspoons garam masala",
                "10": "2 teaspoons ground cumin",
                "11": "2 teaspoons ground turmeric",
                "12": "1 1/2 teaspoons ground coriander",
                "13": "3/4 teaspoon cayenne pepper",
                "14": "3/4 teaspoon ground cardamom",
                "15": "8 cups low-sodium chicken broth",
                "16": "3/4 cup canned tomato purée",
                "17": "1/2 cup heavy cream",
                "18": "1 pound small Yukon Gold potatoes, sliced 1/4\" thick",
                "19": "Plain yogurt, torn fresh mint, and naan, flatbread, or cooked rice (for serving)"
            },
            "Instructions": "Heat ghee in a large Dutch oven over medium heat. Season chicken with salt and pepper. Working in batches, cook chicken, skin side down, until golden brown (do not turn), 8–10 minutes. Transfer to a plate.\nAdd onion, garlic, and ginger to pot and cook, stirring occasionally, until onion is very soft and golden brown, 8–10 minutes. Add tomato paste, garam masala, cumin, turmeric, coriander, cayenne, and cardamom and cook, stirring often, until tomato paste is beginning to darken, about 4 minutes.\nAdd chicken, broth, tomato purée, and cream to pot; season with salt and pepper. Bring to a boil, reduce heat, and simmer, partially covered, skimming occasionally, until chicken is almost falling off the bone and liquid is slightly thickened, 1 1/2–2 hours.\nAdd potatoes to pot and cook, partially covered, until potatoes are fork-tender, chicken is falling off the bone, and liquid is thick enough to coat a spoon, 30–45 minutes. Remove skin and bones from chicken, if desired, and return meat to pot; season stew with salt and pepper.\nDivide stew among bowls, top with yogurt and mint, and serve with naan, flatbread, or rice.\nDO AHEAD: Stew can be made 3 days ahead. Let cool; cover and chill.",
            "Image": "//20fix.com/xfood/img/indian-spiced-chicken-with-tomato-and-cream-51214470.jpg"
        },
        {
            "id": "6405",
            "Title": "Ghee (Indian Clarified Butter)",
            "Ingredients": {
                "1": "1 stick (1/2 cup) unsalted butter, cut into pieces"
            },
            "Instructions": "Line a sieve with 3 layers of cheesecloth and set over a jar.\nBring butter to a boil in a small heavy saucepan over medium heat. Once foam completely covers butter, reduce heat to very low and continue to cook, stirring occasionally, until a thin crust begins to form on surface and milky white solids fall to bottom of pan, about 8 minutes. Continue to cook butter, watching closely and stirring occasionally to prevent burning, until milk solids on bottom of pan are light brown and liquid is golden, translucent, and fragrant, about 3 minutes. Remove from heat and strain through cheesecloth-lined sieve into jar.",
            "Image": "//20fix.com/xfood/img/indian-clarified-butter-394656.jpg"
        },
        {
            "id": "6866",
            "Title": "South Indian Lentil Cakes with Raita",
            "Ingredients": {
                "1": "1 head of garlic",
                "2": "1 tablespoon extra-virgin olive oil",
                "3": "Kosher salt, freshly ground pepper",
                "4": "1/4 teaspoon cumin seeds",
                "5": "1 cup plain low-fat yogurt",
                "6": "1/4 cup finely chopped peeled seeded cucumber",
                "7": "1 teaspoon chopped fresh cilantro",
                "8": "1 teaspoon chopped fresh mint",
                "9": "1 teaspoon minced seeded jalapeño",
                "10": "1/2 teaspoon (or more) fresh lemon juice",
                "11": "1/2 cup mixed dried legumes (such as lentils and whole mung beans)",
                "12": "1/4 cup basmati rice",
                "13": "1 garlic clove, minced",
                "14": "1 teaspoon chopped peeled fresh ginger",
                "15": "1/2 jalapeño, seeded, minced",
                "16": "1 cup leaves from pea tendrils, arugula, or spinach, chopped",
                "17": "1/2 cup peas (from about 8 ounces peas in pods), chopped",
                "18": "1/4 cup chopped fresh cilantro",
                "19": "1/4 cup chopped scallions",
                "20": "3 tablespoons chopped fresh mint",
                "21": "1 teaspoon kosher salt",
                "22": "1 teaspoon freshly ground black pepper",
                "23": "4 tablespoons extra-virgin olive oil, divided"
            },
            "Instructions": "Preheat oven to 450°F. Cut top 1/2\" off head of garlic; discard. Place garlic on a sheet of foil. Drizzle with oil; sprinkle with salt and pepper. Wrap in foil. Roast until tender, about 45 minutes. Let cool. Squeeze cloves from skins, keeping cloves intact.\nStir cumin in a small dry skillet over medium heat until deep brown, 2-3 minutes. Let cool. Finely grind in a spice mill.\nMix yogurt, cucumber, cilantro, mint, jalapeño, and 1/2 teaspoon lemon juice in a medium bowl. Stir in cumin. Season with salt, pepper, and more lemon juice, if desired.\nRinse legumes; place in a medium bowl with rice. Add water to cover by 3\". Let legumes and rice soak at room temperature for 3-5 hours.\nDrain legumes and rice; transfer to a food processor. Add garlic, ginger, and jalapeño. Process until grainy paste forms (add 1-2 tablespoons water if necessary). Transfer to a large bowl; mix in tendrils and next 6 ingredients.\nHeat 1 tablespoon oil in a large nonstick skillet over medium-high heat. Spoon 4 scant 1/4-cupfuls of batter into skillet, flattening with the back of a measuring cup into 1/4\"-thick cakes. Reduce heat to medium; sauté until golden brown and cooked through, adding 1 more tablespoon oil when cakes are flipped, about 4-5 minutes per side. Repeat with remaining oil and batter. Divide raita among plates; top with a roasted garlic clove. Place 2 cakes on each plate.",
            "Image": "//20fix.com/xfood/img/south-indian-lentil-cakes-with-raita-367156.jpg"
        },
        {
            "id": "7465",
            "Title": "Indian Eggplant and Onion Dip with Pita Chips",
            "Ingredients": {
                "1": "3 pita bread rounds, cut horizontally in half, then cut into wedges",
                "2": "4 tablespoons olive oil, divided",
                "3": "1 1 1/4-pound eggplant, quartered lengthwise",
                "4": "2 1/2 cups chopped onions",
                "5": "2 unpeeled garlic cloves",
                "6": "2 tablespoons chopped fresh mint",
                "7": "2 tablespoons chopped fresh cilantro",
                "8": "1/2 teaspoon garam masala"
            },
            "Instructions": "Preheat oven to 475°F. Arrange pita wedges in single layer on rimmed baking sheet; brush pita lightly with 1 tablespoon olive oil.\nPlace eggplant, skin side down, on half of another rimmed baking sheet. Place onions and garlic on other half of sheet. Brush eggplant with 2 tablespoons oil; drizzle onions and garlic with 1 tablespoon oil. Toss vegetables; spread in thin layer.\nBake pita until crisp, about 4 minutes. Roast vegetables until browned and tender, about 30 minutes. Peel garlic. Scoop out pulp from eggplant and transfer to processor. Add onions and peeled garlic; puree until almost smooth. Transfer puree to bowl; mix in mint, cilantro, and garam masala. Season with salt and pepper; serve with pita chips.",
            "Image": "//20fix.com/xfood/img/indian-eggplant-and-onion-dip-with-pita-chips-362273.jpg"
        },
        {
            "id": "8213",
            "Title": "Grilled Meatballs with Indian-Spiced Yogurt Sauce",
            "Ingredients": {
                "1": "2 pounds ground beef round",
                "2": "1 large red onion, minced",
                "3": "2 large cloves garlic",
                "4": "3 tablespoons light soy sauce",
                "5": "2 large eggs, beaten",
                "6": "1 teaspoon minced ginger",
                "7": "1 teaspoon salt",
                "8": "1/2 teaspoon freshly ground pepper",
                "9": "4 teaspoons extra virgin olive oil",
                "10": "1 pint yogurt",
                "11": "2 medium cloves garlic, minced",
                "12": "1 tablespoon fresh lemon juice",
                "13": "2 tablespoons extra virgin olive oil",
                "14": "2 teaspoons ground cumin",
                "15": "2 teaspoons ground turmeric",
                "16": "1/4 teaspoon cayenne",
                "17": "Salt and freshly ground pepper",
                "18": "2 tablespoons minced curly parsley"
            },
            "Instructions": "1. Combine the ground beef, onion, garlic, soy sauce, eggs, ginger, salt, and pepper in the bowl. Mix the ingredients with your hands until they are well blended and hold together well.\n2. Preheat the broiler.\n3. Brush the baking sheet with 2 teaspoons of the oil. With your hands, form the meat mixture into 24 round balls and place them 1 1/2 inches apart on the baking sheet. (Each ball should weigh about 1/2 ounce.) Lightly moisten your hands before forming each ball to facilitate rolling. Brush the meatballs with the remaining oil and broil them, 4 inches from the heating element, 6 to 8 minutes, turning them once, until they are cooked through.\nPlace the meatballs in a shallow bowl with the Indian-Spiced Yogurt Sauce on the side, or cut off the top of a small round loaf of bread, remove the insides, and spoon the meatballs into the bread. Dust with chopped parsley for color.\n1. Line the strainer with the cheesecloth. Place it over a bowl and spoon the yogurt into the strainer. Allow the yogurt to drain in the refrigerator for 3 hours.\n2. Transfer the drained yogurt from the cheesecloth to the other bowl and blend in the garlic, lemon juice, oil, cumin, turmeric, and cayenne. Season to taste with salt and black pepper.",
            "Image": "//20fix.com/xfood/img/grilled-meatballs-with-indian-spiced-yogurt-sauce-355974.jpg"
        },
        {
            "id": "8703",
            "Title": "Indian Cheese and Red Peppers in Fragrant Spinach Sauce",
            "Ingredients": [
                "[\"Indian cheese (paneer) made with 8 cups milk (see tips, below) or 8 ounces farmer's cheese or 2 cakes tofu, sliced as paneer\", '2 cups cooked spinach",
                "1 sweet green pepper, cored and seeded",
                "6-8 tablespoons light vegetable oil",
                "1/3 cup all-purpose flour for dusting",
                "1 1/2 cups finely chopped onion",
                "2 tablespoons grated or crushed fresh ginger",
                "1/2 teaspoon turmeric",
                "4 hot green chilies, minced",
                "1/2 cup water",
                "1 teaspoon coarse salt, or to taste",
                "2 medium-size sweet red peppers, cored, seeded, and cut into 1-inch-wide strips",
                "2 teaspoons garam masala (see tips, below)"
            ],
            "Instructions": "1. Lay the paneer, farmer's cheese, or tofu pieces in a single layer on a cookie sheet lined with paper towels and let dry for 10 minutes (this will enable them to hold their shape better during cooking).\n2. Puree the spinach and green pepper together in a food processor or blender. The puree should be as fine and velvety as you can make it.\n3. Heat 4 tablespoons of the oil in a large, heavy, nonstick pan over medium heat. Dust the paneer pieces lightly with flour and add them to the pan. Fry them in batches, turning and tossing them until they turn light golden (about 2 or 3 minutes per batch). Watch carefully to ensure that they do not burn. Take them out and put on a dish and set aside.\n4. Add 2 more tablespoons of oil to the same pan, along with the onion. Fry the onion, stirring constantly, until brown (about 20 minutes). Add the ginger and fry for an additional 2 minutes. Add the turneric and green chilies, stir for a few seconds, then add the spinach puree along with 1/2 cup water, salt, and sweet red peppers. Mix well and bring to a boil. Lower heat and cook, covered, for 2 minutes. Add the fried paneer pieces, mix again thoroughly, and continue cooking for 2 more minutes. Stir in the garam masala.\nWhen ready to serve, heat thoroughly and, if desired, fold in the remaining 2 tablespoons of oil to glaze and mellow the sauce.",
            "Image": "//20fix.com/xfood/img/indian-cheese-and-red-peppers-in-fragrant-spinach-sauce-230902.jpg"
        },
        {
            "id": "9449",
            "Title": "Indian Shrimp Curry",
            "Ingredients": {
                "1": "6 to 8 fresh serrano chiles (2 ounces total)",
                "2": "20 fresh curry leaves",
                "3": "5 garlic cloves, finely chopped",
                "4": "1 tablespoon finely chopped peeled ginger",
                "5": "2 tablespoons vegetable oil",
                "6": "1 teaspoon whole mustard seeds",
                "7": "1 teaspoon ground coriander",
                "8": "1/2 teaspoon ground cumin",
                "9": "1/4 teaspoon ground turmeric",
                "10": "1 medium onion, chopped",
                "11": "1 pound tomatoes, chopped",
                "12": "2 1/2 ounces finely grated fresh or dried unsweetened coconut (1 cup; visit gourmet.com for how to extract meat from fresh coconut)",
                "13": "2 pounds large shrimp in shell, peeled and deveined",
                "14": "Accompaniment: white rice"
            },
            "Instructions": "Quarter chiles lengthwise (seed and devein if you want less heat). Cook chiles, curry leaves, garlic, and ginger in oil in a 12-inch heavy skillet over medium-high heat, stirring, until very fragrant and chiles are just softened, 1 to 2 minutes.\nReduce heat to medium and add spices, 1 teaspoon salt, and 1/2 teaspoon pepper. Cook, stirring, until mustard seeds just begin to pop, 1 to 2 minutes.\nAdd onion and cook, stirring occasionally, until softened, about 4 minutes.\nAdd tomatoes and coconut, then cook, covered, until tomatoes are softened, 4 to 6 minutes.\nAdd shrimp and cook, uncovered, stirring, until just cooked through, 3 to 4 minutes. Season with salt and pepper.",
            "Image": "//20fix.com/xfood/img/indian-shrimp-curry-243199.jpg"
        },
        {
            "id": "9948",
            "Title": "Traditional Indian Raita",
            "Ingredients": {
                "1": "1/2 cup plain yogurt",
                "2": "1/2 cup chopped seeded English hothouse cucumber",
                "3": "2 tablespoons chopped fresh cilantro",
                "4": "2 teaspoons chopped green onions",
                "5": "1/4 teaspoon ground coriander",
                "6": "1/4 teaspoon ground cumin"
            },
            "Instructions": "Mix all ingredients in medium bowl. Season to taste with salt. Chill raita, covered, until ready to serve.",
            "Image": "//20fix.com/xfood/img/traditional-indian-raita-242185.jpg"
        },
        {
            "id": "10435",
            "Title": "Indian-Spiced Pickled Vegetables",
            "Ingredients": {
                "1": "1/2 seedless cucumber",
                "2": "1/2 large head cauliflower, cut into 1 1/2-inch-wide florets (4 cups)",
                "3": "1/2 lb carrots (4 medium), cut into 2 1/2- by 1/2-inch sticks (2 cups)",
                "4": "3 tablespoons coarsely chopped garlic (6 cloves)",
                "5": "3 tablespoons coarsely chopped peeled ginger",
                "6": "1 tablespoon mustard seeds (preferably black or brown)",
                "7": "1 teaspoon coriander seeds",
                "8": "1 teaspoon ground turmeric",
                "9": "1/2 teaspoon cumin seeds",
                "10": "1/2 teaspoon fennel seeds",
                "11": "1/3 cup vegetable oil",
                "12": "5 (2-inch) dried hot red chiles, wiped clean",
                "13": "1/2 cup distilled white vinegar",
                "14": "3 tablespoons packed dark brown sugar",
                "15": "Equipment: an electric coffee/spice grinder; a well-seasoned 14-inch flat-bottomed wok"
            },
            "Instructions": "Preheat oven to 250°F with rack in middle.\nTrim end from cucumber, then halve lengthwise. Scrape out and discard any seeds with a small spoon, then cut into 2- by 1/2-inch sticks.\nCook cauliflower and carrots together in a large pot of boiling salted water (1 1/2 tablespoons salt for 3 quarts water), stirring occasionally, 1 minute. Drain in a colander, then put colander in an ice bath. Drain again in colander, then pat vegetables very dry.\nArrange cauliflower, carrots, and cucumber in 1 layer in a 17- by 12-inch shallow baking pan and bake, stirring occasionally, until vegetables are dry and slightly limp, about 30 minutes.\nPulse garlic and ginger with 1 teaspoon salt in a food processor until finely ground, then transfer to a bowl. Pulse mustard seeds in spice grinder until coarsely ground, then stir together with remaining spices. Heat wok over high heat until a drop of water evaporates instantly. Pour oil down side of wok, then tilt wok to swirl, coating side. When oil just begins to smoke, add chiles and spice mixture and cook, stirring, 10 seconds. Add garlic mixture and cook, stirring, until golden, about 15 seconds. Add vegetables, vinegar, and brown sugar and bring to a boil, stirring until sugar has dissolved. Transfer to a shallow dish and cool to room temperature, stirring occasionally, about 1 hour.\nTransfer to an airtight container and chill, shaking once or twice a day, 1 week (to allow flavors to develop).",
            "Image": "//20fix.com/xfood/img/indian-spiced-pickled-vegetables-240543.jpg"
        },
        {
            "id": "10640",
            "Title": "Roasted Cauliflower with Indian Barbecue Sauce",
            "Ingredients": {
                "1": "1 tablespoon ground cumin",
                "2": "1 2-pound head of cauliflower, cored, cut into 1-inch florets (about 8 cups) 4 tablespoons vegetable oil, divided",
                "3": "1 teaspoon minced peeled fresh ginger",
                "4": "1 garlic clove, pressed",
                "5": "1 1/4 cups ketchup",
                "6": "1/4 cup soy sauce",
                "7": "2 tablespoons sugar"
            },
            "Instructions": "Preheat oven to 400°F. Toast cumin in small skillet over medium heat until darker in color and beginning to smoke, about 11/2 minutes. Set aside.\nToss cauliflower and 2 tablespoons oil in large bowl. Transfer to medium rimmed baking sheet. Roast until very tender, stirring occasionally, about 45 minutes.\nMeanwhile, heat remaining 2 tablespoons oil in small saucepan over medium-low heat. Add ginger and garlic; sauté until very fragrant, about 3 minutes. Add ketchup, soy sauce, sugar, and toasted cumin. Bring to boil, whisking to blend. Reduce heat to very low; simmer barbecue sauce 1 minute to blend flavors, whisking constantly.\nRemove cauliflower from oven; transfer to large bowl. Toss with enough barbecue sauce to coat; season to taste with salt and pepper.",
            "Image": "//20fix.com/xfood/img/roasted-cauliflower-with-indian-barbecue-sauce-239826.jpg"
        },
        {
            "id": "11293",
            "Title": "Fragrant Indian Brittle",
            "Ingredients": {
                "1": "Vegetable oil for greasing parchment paper",
                "2": "1 teaspoon green cardamom pods (about 8 pods)",
                "3": "2 cups sugar",
                "4": "1/4 cup mild honey",
                "5": "1/4 cup light corn syrup",
                "6": "1/4 cup water",
                "7": "3/4 teaspoon salt",
                "8": "1 cup raw cashews, coarsely chopped (4 1/2 oz)",
                "9": "1/2 cup shelled pistachios (not dyed red; 2 1/4 oz), coarsely chopped",
                "10": "1/2 cup sliced almonds (preferably with skin; 2 oz)",
                "11": "parchment paper; a candy thermometer"
            },
            "Instructions": "Put oven rack in middle position and preheat oven to 300°F. Lightly oil 2 (16- by 12-inch) sheets of parchment paper with vegetable oil and put 1 sheet, oiled side up, on a heatproof work surface.\nCrush cardamom pods with side of a large heavy knife and scrape out seeds, discarding pods. Coarsely crush seeds with mortar and pestle or side of heavy knife.\nBring sugar, honey, corn syrup, water, crushed cardamom seeds, and salt to a boil in a 4- to 5-quart heavy pot over moderately high heat, stirring occasionally, then boil, stirring occasionally, until mixture registers 350°F on thermometer, about 9 minutes.\nAdd nuts and cook, stirring constantly with a wooden spoon, until mixture returns to a boil, about 1 minute. Carefully pour hot caramel mixture onto parchment on work surface (use caution when pouring hot liquids) and carefully cover with remaining sheet of parchment, oiled side down. Immediately roll out mixture between parchment sheets, pressing firmly with a large wooden rolling pin to 1/4 inch thick (use caution; mixture will still be hot). If brittle hardens before it is thin enough, transfer to a large baking sheet (still between parchment sheets) and warm brittle in oven 5 minutes to soften, then continue rolling to 1/4 inch thick.\nCool brittle until firm enough to hold its shape but still pliable, 2 to 5 minutes, then remove top sheet of parchment. Lightly oil blade of a large heavy knife or a pizza cutter and score surface of brittle into 1 1/2-inch squares. If brittle hardens too much to score, transfer to a large baking sheet and warm on parchment, uncovered, until surface softens, about 5 minutes, then immediately score remaining lines. Cool brittle completely, uncovered, about 30 minutes. Invert brittle and peel off bottom sheet of parchment, then break into pieces.\nBrittle keeps in an airtight container, layered between sheets of parchment or wax paper, at room temperature 1 month.",
            "Image": "//20fix.com/xfood/img/fragrant-indian-brittle-236700.jpg"
        },
        {
            "id": "11965",
            "Title": "Grilled Indian-Spiced Butter Chicken",
            "Ingredients": {
                "1": "1 cup chopped onion (1 medium)",
                "2": "3 tablespoons finely chopped garlic",
                "3": "2 tablespoons finely chopped peeled fresh ginger",
                "4": "1 1/4 teaspoons salt",
                "5": "1 small green fresh Thai or serrano chile, coarsely chopped, including seeds",
                "6": "1 teaspoon white distilled vinegar', \"1/3 cup thick plain yogurt, such as Greek yogurt or lebneh, or drained regular yogurt (see cooks' note, below)\", '1 1/2 tablespoons ground coriander",
                "7": "1 tablespoon vegetable oil",
                "8": "1 teaspoon ground turmeric",
                "9": "1/2 teaspoon cayenne",
                "10": "1 (3- to 3 1/2-lb) chicken, quartered, then backbone and as much skin as possible discarded",
                "11": "1 stick (1/2 cup) unsalted butter"
            },
            "Instructions": "Purée onion, garlic, ginger, salt, chile, and vinegar to a smooth paste in a food processor. Transfer to a large wide bowl and whisk in yogurt, coriander, oil, turmeric, and cayenne. Add chicken pieces and turn to coat thickly. Cover with plastic wrap and marinate, chilled, at least 16 hours. Let stand at room temperature 30 minutes before grilling.\nBring butter to a boil in a 1-quart heavy saucepan over moderate heat. When foam completely covers butter, reduce heat to very low. Cook butter until a very thin crust begins to form on surface and milky white solids fall to bottom of pan, about 8 minutes. Continue to cook butter, watching constantly, until solids at bottom of pan turn light brown and butter has a nutty fragrance, 8 to 16 minutes.\nRemove pan from heat and let butter stand 1 minute. Pour through a sieve lined with a dampened heavy-duty paper towel or a triple layer of cheesecloth into a bowl, discarding solids.\nPrepare grill for cooking over indirect heat with medium-hot charcoal (moderate heat for gas); see Grilling Procedure .\nTo cook chicken using a charcoal grill: Lightly oil grill rack. Put chicken (still heavily coated with marinade) on rack over area of grill with no coals underneath. Drizzle chicken with about 1 tablespoon ghee. Cook chicken over medium-high heat, turning over and drizzling with ghee every 5 minutes, until cooked through, 20 to 25 minutes.\nTo cook chicken using a gas grill: Lightly oil grill rack. Put chicken over shut-off burner. Cook chicken, turning over and drizzling with ghee every 5 minutes, until cooked through, about 20 to 25 minutes. (Cover grill between turns.)\nServe chicken drizzled with any remaining ghee.",
            "Image": "//20fix.com/xfood/img/grilled-indian-spiced-butter-chicken-234646.jpg"
        },
        {
            "id": "13128",
            "Title": "Indian-Spiced Chicken Kebabs with Cilantro-Mint Chutney",
            "Ingredients": {
                "1": "1/2 cup (packed) fresh mint leaves",
                "2": "1/2 cup (packed) fresh cilantro",
                "3": "1 tablespoon fresh lemon juice",
                "4": "2 1/2 teaspoons minced fresh ginger",
                "5": "1 jalapeño chili, seeded, minced",
                "6": "2 tablespoons (or more) plain yogurt",
                "7": "1/2 cup plain yogurt', \"3 tablespoons tikka paste or mild curry paste (such as Patak's)\", '1 tablespoon olive oil",
                "8": "2 garlic cloves, minced",
                "9": "2 teaspoons minced fresh ginger",
                "10": "1/4 teaspoon cayenne pepper",
                "11": "1 1/2 pounds skinless boneless chicken breasts, cut into 2-inch cubes",
                "12": "24 (about) 6-inch bamboo skewers, soaked 30 minutes in water",
                "13": "Butter lettuce leaves",
                "14": "1/2 small English hothouse cucumber, halved lengthwise, thinly sliced crosswise",
                "15": "2 limes, cut into wedges"
            },
            "Instructions": "Blend first 5 ingredients and 2 tablespoons yogurt in blender or processor. Blend in more yogurt if necessary to make smooth paste. (Chutney can be made 1 day ahead. Cover and refrigerate.)\nWhisk first 6 ingredients in large bowl to blend. Add chicken and toss to coat. Cover and refrigerate at least 2 hours and up to 12 hours.\nPreheat broiler. Thread 1 chicken piece on each skewer. Cover exposed part of skewers with foil. Broil chicken until cooked through, turning occasionally, about 8 minutes. Arrange lettuce and cucumber on platter. Top with chicken. Squeeze lime over. Serve chicken with Cilantro-Mint Chutney.",
            "Image": "//20fix.com/xfood/img/indian-spiced-chicken-kebabs-with-cilantro-mint-chutney-107682.jpg"
        },
        {
            "id": "13377",
            "Title": "Chilled Indian-Spiced Tomato Soup with Crabmeat",
            "Ingredients": {
                "1": "1 tablespoon cumin seeds",
                "2": "1 tablespoon coriander seeds",
                "3": "1 tablespoon fennel seeds",
                "4": "1 teaspoon yellow mustard seeds",
                "5": "1 teaspoon black peppercorns",
                "6": "6 tablespoons extra-virgin olive oil",
                "7": "2 cups chopped celery",
                "8": "1 1/2 cups chopped onion",
                "9": "1 cup chopped carrots",
                "10": "1/4 cup chopped peeled fresh ginger (from about 3-inch-long piece)",
                "11": "6 garlic cloves, chopped",
                "12": "1 pound red bell peppers, chopped",
                "13": "1 3/4 cups chopped fresh fennel bulb",
                "14": "3 pounds plum tomatoes, diced (about 8 cups)",
                "15": "5 1/4 cups vegetable broth",
                "16": "2 teaspoons (about) hot pepper sauce",
                "17": "1 pound fresh crabmeat, picked over",
                "18": "Thinly sliced radishes",
                "19": "Chopped fresh chives"
            },
            "Instructions": "Toast all ingredients in heavy medium skillet over medium heat until spices darken slightly in color and start to pop, stirring occasionally, about 7 minutes. Cool in skillet. Transfer to spice mill and grind finely.\nHeat oil in heavy large pot over medium-high heat. Add celery, onion, and carrots. Sauté until vegetables soften slightly, about 8 minutes. Add ginger and garlic and sauté 3 minutes. Add bell peppers and fennel. Stir 2 minutes to coat. Add tomatoes; cook until tomatoes soften and break down, stirring often, about 8 minutes. Add broth and bring soup to boil. Reduce heat to medium; simmer until all vegetables are tender, about 25 minutes. Add ground spice mix; return soup to boil. Remove from heat; cover and steep 20 minutes.\nPlace coarse sieve over large bowl. Working with 2 cups at a time, strain soup into bowl, pressing liquid and most of solids through sieve. Season soup to taste with hot pepper sauce, salt, and pepper. Refrigerate soup until cold, at least 3 hours. (Can be made 1 day ahead. Cover and keep refrigerated.)\nLadle soup into 8 shallow bowls. Divide crabmeat among bowls. Garnish with radish slices and chives.",
            "Image": "//20fix.com/xfood/img/chilled-indian-spiced-tomato-soup-with-crabmeat-108549.jpg"
        }
    ],
    "t": 16,
    "p": {
        "limitstart": 0,
        "limit": 25,
        "total": 16,
        "pagesStart": 1,
        "pagesStop": 1,
        "pagesCurrent": 1,
        "pagesTotal": 1
    }
}