{
    "s": 1,
    "d": [
        {
            "id": "3",
            "Title": "Italian Sausage and Bread Stuffing",
            "Ingredients": {
                "1": "1 (¾- to 1-pound) round Italian loaf, cut into 1-inch cubes (8 cups)",
                "2": "2 tablespoons olive oil, divided",
                "3": "2 pounds sweet Italian sausage, casings removed, divided",
                "4": "1 stick unsalted butter, cut into pieces",
                "5": "3 medium onions, chopped",
                "6": "4 large celery ribs, chopped",
                "7": "5 garlic cloves, minced",
                "8": "4 large eggs, lightly beaten",
                "9": "¾ cup heavy cream, divided",
                "10": "½ cup turkey giblet stock or reduced-sodium chicken broth",
                "11": "1 cup grated Parmigiano-Reggiano (2 ounces)",
                "12": "½ cup coarsely chopped flat-leaf parsley",
                "13": "4-qt shallow ceramic or glass baking dish"
            },
            "Instructions": "Preheat oven to 350°F with rack in middle. Generously butter baking dish.\nPut bread in 2 shallow baking pans and bake, switching position of pans halfway through baking, until just dried out, about 10 minutes.\nHeat 1 tablespoon oil in a 12-inch heavy skillet over medium-high heat until it shimmers, then cook half of sausage, stirring and breaking it into small pieces, until golden brown, about 6 minutes. Transfer with a slotted spoon to a large bowl. Brown remaining sausage in remaining tablespoon oil, transferring to bowl.\nPour off fat from skillet and wipe clean. Heat butter over medium heat until foam subsides, then cook onions, celery, garlic, and ½ teaspoon each of salt and pepper, stirring occasionally, until golden, 12 to 15 minutes. Add vegetables and bread to sausage.\nWhisk together eggs, ½ cup cream, turkey stock, cheese, and parsley, then stir into stuffing and cool completely, about 30 minutes. Reserve 5 cups stuffing to stuff turkey and spoon remainder into baking dish, then drizzle with remaining ¼ cup cream. Cover stuffing and chill.\nAbout 1 hour before stuffed turkey is finished roasting, bring dish of stuffing to room temperature. When turkey is done, increase oven temperature to 425°F and bake stuffing, covered tightly with foil, until hot throughout, about 20 minutes. Remove foil and bake until top is golden and crisp, about 15 minutes more.\nCooks' Note: Bread can be toasted 3 days ahead and kept (once cool) in a sealed bag at room temperature. Stuffing can be prepared (but not baked) 4 hours before roasting turkey. If baking stuffing at the same time as potatoes, put stuffing in upper third of oven and potatoes in bottom third (allow extra time).",
            "Image": "//20fix.com/xfood/img/italian-sausage-and-bread-stuffing-240559.jpg"
        },
        {
            "id": "493",
            "Title": "Italian Fish and Vegetable Stew",
            "Ingredients": {
                "1": "1 lb. firm white skinless fish fillets (such as mahi-mahi, cod, or halibut), cut into 2\" pieces",
                "2": "Kosher salt, freshly ground pepper",
                "3": "1 Tbsp. fresh lemon juice",
                "4": "1 Tbsp. red wine vinegar",
                "5": "1/2 tsp. Dijon mustard",
                "6": "3 Tbsp. extra-virgin olive oil, divided",
                "7": "1 cup dry or instant polenta (coarse cornmeal)",
                "8": "1 garlic clove, smashed",
                "9": "1 medium yellow bell pepper, seeds and ribs removed, cut into 2\" pieces",
                "10": "1 medium zucchini, cut into 2\" pieces",
                "11": "1 pint cherry or grape tomatoes, halved",
                "12": "1 Tbsp. slivered fresh basil (or 1 tsp. dried), plus whole leaves for serving",
                "13": "1 tsp. chopped fresh oregano (or 1/2 tsp. dried), plus whole leaves for serving"
            },
            "Instructions": "Season fish with salt and pepper. Whisk lemon juice, vinegar, mustard, and 2 Tbsp. oil in a medium bowl. Add fish, toss to coat, and chill until ready to use.\nCook polenta according to package directions.\nMeanwhile, heat remaining 1 Tbsp. oil in a large skillet over medium-high. Cook garlic, stirring occasionally, until beginning to brown, about 2 minutes. Transfer garlic to a plate.\nCook bell pepper in same skillet, stirring frequently, until beginning to brown and soften, about 3 minutes. Add zucchini, cover, and cook 3 minutes.\nReduce heat to medium-low. Add tomatoes, garlic, fish and dressing, 1 Tbsp. slivered basil, and 1 tsp. chopped oregano; season with salt and pepper. Cover and simmer just until fish is cooked through, about 5 minutes. Discard garlic, if desired.\nDivide polenta among bowls. Arrange fish mixture over. Garnish with basil and oregano.",
            "Image": "//20fix.com/xfood/img/italian-fish-and-vegetable-stew.jpg"
        },
        {
            "id": "747",
            "Title": "Gina’s Arancini (Italian Rice Balls)",
            "Ingredients": {
                "1": "2 cups (380 g) Arborio rice",
                "2": "5 cups (1.2 L) chicken broth or water",
                "3": "1/2 tablespoon unsalted butter",
                "4": "1 1/2 teaspoons extra-virgin olive oil",
                "5": "1/2 cup (80g) finely chopped prosciutto",
                "6": "1 1/2 cups (150 g) Italian bread crumbs",
                "7": "1 large egg, beaten",
                "8": "1 teaspoon parsley, chopped",
                "9": "1/3 cup (30 g) grated Parmigiano cheese",
                "10": "1 teaspoon coarse salt",
                "11": "4 ounces (115 g) fresh mozzarella, cut into 1/4-inch (6-mm) cubes",
                "12": "4 cups (960 ml) vegetable oil",
                "13": "Grated Parmesan cheese, for garnish"
            },
            "Instructions": "Combine the rice and broth in a large pot. Bring to a boil and then reduce to a simmer, cover, and cook until the water is absorbed and the rice is soft and creamy, about 15 to 20 minutes. Stir occasionally to ensure the rice doesn’t stick to the bottom of the pot.\nWhile the rice is cooking, heat the butter and olive oil in a small pan over medium heat and add the prosciutto. Cook until it begins to crisp, about 2 minutes. Set aside.\nOnce the rice is cooked, remove to a large baking sheet and let cool for 10 minutes. (Rice can be made a day ahead, cooled, and stored in the refrigerator overnight.)\nWhile the rice is cooling, pour 1/2 cup (120 ml) room-temperature water into a shallow bowl. Place the bread crumbs in a separate shallow bowl. Set both aside.\nOnce the rice is cool, combine it with the crisped prosciutto, egg, parsley, Parmigiano cheese, and salt in a large bowl.\nUsing an ice cream scoop or lightly wet hands, create a 2-inch (5-cm) round ball with the rice mixture. Make an indentation in the middle and add a cube of mozzarella cheese. Encase the cheese with rice and reshape into a perfect ball, then set on the baking sheet. Repeat with the remaining rice mixture.\nUsing your hands, lightly wet the outside of each of the rice balls with the room-temperature water, then roll in the bread crumbs. Set them on the baking sheet.\nHeat the vegetable oil in a large pot to 350°F (175°C). Drop 4 rice balls into the oil (they should fully submerge) and cook until the outside is golden brown, about 3 minutes. If your pot is wide, carefully roll the rice balls in the oil to ensure even cooking on all sides.\nTransfer to paper towels to drain. Repeat with the remaining rice balls. They are best eaten at room temperature, garnished with a sprinkling of grated Parmesan cheese, if you can wait!",
            "Image": "//20fix.com/xfood/img/arancini-italian-rice-balls-with-prosciutto-parmesan.jpg"
        },
        {
            "id": "840",
            "Title": "Winter Italian Chopped Salad",
            "Ingredients": {
                "1": "3 Tbsp. fresh orange juice",
                "2": "3 Tbsp. red wine vinegar",
                "3": "1 large garlic clove, finely grated",
                "4": "1 Tbsp. chopped oregano",
                "5": "1 tsp. Dijon mustard",
                "6": "1/4 cup plus 2 Tbsp. extra-virgin olive oil, plus more for drizzling",
                "7": "1 1/4 tsp. kosher salt, divided",
                "8": "1/2 lb. marinated artichoke hearts from a 12-oz. jar (about 1 1/2 cups), drained",
                "9": "4 oz. mini pepperoni rounds",
                "10": "2 (15.5-oz.) cans chickpeas, drained, rinsed, dried",
                "11": "1/2 head of iceberg lettuce, cut into 1\" pieces (about 8 cups)",
                "12": "1/2 head of radicchio, cut into 1\" pieces (about 3 cups)",
                "13": "4 stalks celery, thinly sliced",
                "14": "2 navel oranges, peel and pith removed, cut into 1/2\" pieces",
                "15": "1/2 lb. provolone cheese, cut into 1/2\" pieces",
                "16": "1 cup pitted black olives, thinly sliced"
            },
            "Instructions": "Preheat oven to 450°F. Whisk orange juice, vinegar, garlic, oregano, mustard, 1/4 cup oil, and 3/4 tsp. salt in a large bowl.\nToss artichokes, pepperoni, chickpeas, and 2 Tbsp. oil on a rimmed baking sheet; season with remaining 1/2 tsp. salt. Roast, tossing halfway through, until chickpeas are deep golden brown and pepperoni is crisp, 18–20 minutes.\nAdd iceberg lettuce, radicchio, celery, oranges, cheese, and olives to bowl with dressing and toss to combine. Add chickpea mixture to salad and toss again to combine. Drizzle with more oil.",
            "Image": "//20fix.com/xfood/img/winter-italian-chopped-salad.jpg"
        },
        {
            "id": "1224",
            "Title": "Italian Sundaes with Nutella",
            "Ingredients": {
                "1": "2 pints fior di latte gelato",
                "2": "1 cup Nutella",
                "3": "Coarsely chopped toasted blanched hazelnuts, crumbled amaretti cookies (Italian macaroons) and/or wafer cookies (for serving)"
            },
            "Instructions": "Place a scoop of gelato into each chilled bowl. Spoon a dollop of Nutella over each and top with another scoop or two of gelato. Top as desired.",
            "Image": "//20fix.com/xfood/img/italian-sundaes-with-nutella.jpg"
        },
        {
            "id": "1225",
            "Title": "Arugula with Italian Plums and Parmesan",
            "Ingredients": {
                "1": "16 Italian plums, halved, or 8 small plums, quartered",
                "2": "1/3 cup cocktail onions, halved,layers separated",
                "3": "2 Tbsp. fresh lemon juice",
                "4": "2 Tbsp. extra-virgin olive oil, plus more for drizzling",
                "5": "3 oz. arugula (about 5 cups)",
                "6": "Kosher salt, freshly ground pepper",
                "7": "3 oz. Parmesan, thinly sliced"
            },
            "Instructions": "Toss plums, cocktail onions, lemon juice, and 2 Tbsp. oil in a large bowl. Add arugula, season with salt and pepper, and toss again. Transfer to a platter; top with Parmesan and drizzle with more oil.",
            "Image": "//20fix.com/xfood/img/arugula-with-italian-plums-and-parmesan.jpg"
        },
        {
            "id": "1345",
            "Title": "Italian Easter Bread",
            "Ingredients": {
                "1": "3 tablespoons plus 1 teaspoon cool water",
                "2": "1/4 teaspoon sugar",
                "3": "1 1/2 teaspoons dry yeast",
                "4": "7 tablespoons unbleached all purpose flour",
                "5": "2/3 cup unbleached all purpose flour",
                "6": "4 large egg yolks",
                "7": "3 tablespoons cool water",
                "8": "2 teaspoons sugar",
                "9": "6 tablespoons (3/4 stick) unsalted butter, room temperature (very soft), cut into 6 pieces",
                "10": "5 tablespoons sugar",
                "11": "2 large egg yolks",
                "12": "2 tablespoons lukewarm whole milk",
                "13": "1 tablespoon honey",
                "14": "2 1/4 cups unbleached all purpose flour",
                "15": "1/2 cup cool water",
                "16": "1 1/2 teaspoons dry yeast",
                "17": "2 cups unbleached all purpose flour",
                "18": "1 cup (2 sticks) unsalted butter, room temperature (very soft), cut into 12 pieces",
                "19": "6 tablespoons sugar",
                "20": "4 large egg yolks",
                "21": "3 tablespoons lukewarm whole milk",
                "22": "2 teaspoons vanilla extract",
                "23": "1 1/2 teaspoons fine sea salt",
                "24": "1 1/2 cups chopped candied orange peel* (about 10 ounces)",
                "25": "1/2 cup (about) all purpose flour",
                "26": "2 dove-shaped paper baking molds (size C3)",
                "27": "1 cup sugar",
                "28": "1/2 cup whole unblanched almonds",
                "29": "3 large egg whites",
                "30": "1/4 teaspoon almond extract",
                "31": "1 1/3 cups sliced almonds",
                "32": "Powdered sugar"
            },
            "Instructions": "Combine water and sugar in bowl of heavy-duty mixer. Stir in yeast. Let stand until yeast dissolves, about 10 minutes. Using rubber spatula, mix in flour (dough will be firm). Cover bowl with plastic wrap. Let starter rise until puffy, about 45 minutes. (Initially, the starter, or biga is firm and compact, but it softens and becomes puffy and spongy after rising.)\nAttach dough hook to mixer. Add all ingredients in step 2 to starter. Beat until blended, scraping down sides of bowl often, about 5 minutes (dough will be soft and thick). Scrape dough off hook; remove hook. Cover bowl with plastic. Let dough rise at room temperature until puffy and bubbly on top, about 1 hour. The dough will look thick, shiny, and slightly puffed.\nReattach clean dough hook. Add first 5 ingredients in step 3 to dough; beat until blended. Add flour. Beat at low speed until smooth, scraping down bowl and hook often, about 5 minutes (dough will be firm and compact). Scrape dough off hook; remove hook. Cover bowl with plastic; let dough rise at room temperature until lighter in texture and slightly puffed, about 3 1/2 hours. The dough will double in volume and become lighter in texture but less glossy.\nReattach clean dough hook. Mix water and yeast in small cup. Let stand until yeast dissolves, about 10 minutes; add to dough. Add 1 1/3 cups flour, half of butter, sugar, and 2 yolks; beat until dough is smooth, about 3 minutes. Scrape down dough hook and sides of bowl. Add remaining 2 yolks, milk, vanilla extract, and salt. Beat at low speed until blended, about 3 minutes. Scrape down hook. Add remaining 2/3 cup flour, remaining butter, and orange peel. Beat dough until well blended, about 5 minutes. Scrape dough into very large (at least 4-quart) buttered bowl. Cover with plastic. Let dough rise at room temperature until doubled and indentation remains when 2 fingers are pressed about 1/4 inch into dough, 8 to 10 hours.\nSprinkle 1/2 cup flour onto work surface. Scrape dough out onto floured work surface (dough will be soft and sticky). Gently toss dough in flour until easy to handle. Brush away excess flour. Divide dough into 3 equal pieces. Divide 1 piece in half; shape each half into 10-inch-long log. Arrange 1 log crosswise in each paper baking mold, curving ends to fit. Roll each remaining dough piece into 11-inch-long log, slightly tapered at ends. Place 1 log across dough in each mold. (If using 2 springform pans, divide dough in half; place half in each prepared pan). Cover molds (or pans) with plastic. Let stand at room temperature until dough rises to top of each mold and indentation remains when 2 fingers are pressed about 1/4 inch into dough, about 3 1/4 hours.\nPosition rack in bottom third of oven and preheat to 375°F. Finely grind sugar and whole almonds in processor. Add egg whites and almond extract; blend 10 seconds. Peel plastic off dough in molds. Spoon half of almond glaze over top of each. Sprinkle each with sliced almonds. Sift powdered sugar over. Slide rimless baking sheet under molds; slide molds directly onto oven rack.\nBake breads until brown on top and slender wooden skewer inserted into center comes out clean, about 45 minutes. Cool breads completely on rack. (Can be made ahead. Wrap; let stand at room temperature up to 2 days or freeze up to 1 week.)\nCandied orange peel can be found in some specialty foods stores. Dove-shaped paper baking molds can be found at Sur La Table (800-243-0852) and some other cookware stores, or you can order the molds, along with fine-quality candied orange peel, from Emporio Rulli (888-887-8554).",
            "Image": "//20fix.com/xfood/img/italian-easter-bread-106404.jpg"
        },
        {
            "id": "1604",
            "Title": "Skillet Stuffing With Italian Sausage and Wild Mushrooms",
            "Ingredients": {
                "1": "2 crusty white demi baguettes (about 10 1/2 ounces), cut into 3/4\" cubes (about 8 cups cubes)",
                "2": "2 tablespoons extra-virgin olive oil, divided",
                "3": "1/2 pound hot or sweet Italian sausage, casings removed",
                "4": "1 medium onion, chopped",
                "5": "8 ounces wild mushrooms, cut into large pieces",
                "6": "2 tablespoons finely chopped sage",
                "7": "1 cup dry white wine",
                "8": "2 large eggs",
                "9": "1 1/4 cups low-sodium chicken broth",
                "10": "1 1/2 ounces finely grated Parmesan or Pecorino (about 1/2 cup)",
                "11": "1 tablespoon Dijon mustard",
                "12": "1 1/4 teaspoons kosher salt",
                "13": "1 teaspoon freshly ground black pepper"
            },
            "Instructions": "Preheat oven to 425°F. Toast bread on a rimmed baking sheet until dry, about 10 minutes. Let cool. Reduce oven temperature to 375°F.\nMeanwhile, heat 1 Tbsp. oil in a 12\" cast-iron skillet over medium-high. Add sausage and cook, breaking into pieces with a spatula, until browned, about 7 minutes. Add onion, mushrooms, and sage and cook, stirring occasionally, until well browned, 8–10 minutes. Add wine and cook, stirring occasionally, until reduced by half. Let cool slightly.\nWhisk eggs, broth, cheese, mustard, salt, and pepper in a large bowl. Add sausage mixture, reserving skillet, and bread and toss to combine. Let sit 5 minutes, toss again, then pack back into skillet.\nBake stuffing until lightly browned on top and cooked through, about 20 minutes.",
            "Image": "//20fix.com/xfood/img/skillet-stuffing-with-italian-sausage-and-wild-mushrooms.jpg"
        },
        {
            "id": "1660",
            "Title": "Iceberg Salad with Italian Dressing",
            "Ingredients": {
                "1": "1/2 cup olive oil",
                "2": "5 tablespoons white wine vinegar",
                "3": "1 tablespoon mayonnaise",
                "4": "1 tablespoon sugar",
                "5": "1 1/2 teaspoons dried oregano",
                "6": "1 garlic clove, finely grated",
                "7": "Kosher salt, freshly ground pepper",
                "8": "1 small head of iceberg lettuce",
                "9": "1/2 small red onion, sliced into rings",
                "10": "2 ounces provolone piccante cheese, thinly sliced",
                "11": "1 cup drained small mozzarella balls, torn",
                "12": "10 peperoncini, halved if large"
            },
            "Instructions": "Whisk oil, vinegar, mayonnaise, sugar, oregano, and garlic in a small bowl. Season with salt and pepper.\nCut lettuce in half through stem end. Tear apart into large pieces. Arrange on a platter and scatter onion, provolone, mozzarella, and peperoncini over, nestling in among leaves. Drizzle with dressing to coat to your liking (you’ll probably have some extra) and top with more black pepper.",
            "Image": "//20fix.com/xfood/img/iceberg-salad-with-italian-dressing.jpg"
        },
        {
            "id": "1769",
            "Title": "Veggie Italian Hoagies",
            "Ingredients": {
                "1": "1 cup drained jarred giardiniera, finely chopped, plus some brine from the jar",
                "2": "1 cup mayonnaise",
                "3": "4 (8-inch) soft Italian sub rolls, split",
                "4": "4 large meaty tomatoes, sliced 1/2 inch thick",
                "5": "Kosher salt",
                "6": "1 head of iceberg lettuce, thinly shredded",
                "7": "Freshly ground black pepper",
                "8": "Olive oil (for drizzling)"
            },
            "Instructions": "Mix giardiniera into mayonnaise in a small bowl. Thickly spread some giardiniera mixture over the bottom half of each roll. Top each with tomato slices; season with salt. Layer on a thick tuft of shredded lettuce; season lettuce with salt, pepper, and a splash of reserved giardiniera brine (about 1 Tbsp. per sandwich). Drizzle with oil.",
            "Image": "//20fix.com/xfood/img/veggie-italian-hoagies.jpg"
        },
        {
            "id": "1802",
            "Title": "Escarole with Italian Sausage and White Beans",
            "Ingredients": {
                "1": "3 tablespoons olive oil",
                "2": "12 Italian sausages (about 3 pounds), casings removed",
                "3": "1 cup chopped onion",
                "4": "1/2 cup chopped prosciutto (about 2 ounces)",
                "5": "1 tablespoon minced garlic",
                "6": "1/2 teaspoon dried crushed red pepper",
                "7": "1 large head escarole, chopped (about 10 cups)",
                "8": "3/4 cup dry white wine",
                "9": "4 (15-ounce) cans Great Northern beans, rinsed, drained",
                "10": "1 cup chicken stock or canned low-salt chicken broth",
                "11": "Freshly grated Parmesan cheese (optional)"
            },
            "Instructions": "Heat oil in heavy large pot over medium-high heat. Working in batches, sauté sausage until cooked through, breaking up with back of spoon, about 6 minutes per batch. Using slotted spoon, transfer sausage to bowl, leaving drippings in pot. Reduce heat to medium; add onion to pot and sauté until translucent, about 5 minutes. Add prosciutto and sauté 1 minute. Mix in garlic and crushed red pepper. Add escarole and sauté until wilted, about 2 minutes. Add wine and cook 2 minutes. Add beans, stock and sausage and simmer 10 minutes to blend flavors. Season to taste with salt and pepper. Transfer to large bowl. Top with grated Parmesan, if desired.",
            "Image": "//20fix.com/xfood/img/escarole-with-italian-sausage-and-white-beans-15600.jpg"
        },
        {
            "id": "1903",
            "Title": "Chicken Spiedie Skewers with Italian Dressing",
            "Ingredients": {
                "1": "1 garlic clove, finely grated",
                "2": "5 tablespoons white wine vinegar",
                "3": "2 tablespoons chopped Peppadew peppers in brine",
                "4": "1 tablespoon mayonnaise",
                "5": "1 tablespoon sugar",
                "6": "1 1/2 teaspoons dried oregano",
                "7": "1/2 cup olive oil, plus more",
                "8": "Kosher salt, freshly ground pepper",
                "9": "1 1/2 pounds skinless, boneless chicken thighs (about 6)",
                "10": "1 large sweet onion, sliced 1/2 inch thick",
                "11": "2 beefsteak tomatoes (about 1 pound), sliced 1/4 inch thick",
                "12": "Oregano leaves and lemon wedges (for serving)",
                "13": "Six to nine 8-inch metal skewers, or wooden skewers soaked 30 minutes in water"
            },
            "Instructions": "Whisk garlic, vinegar, peppers, mayonnaise, sugar, dried oregano, and 1/2 cup oil in a medium bowl; season with salt and pepper. Transfer half of dressing to a small bowl; cover and chill until ready to serve.\nCut chicken thighs lengthwise into long strips, about 1\"–1 1/2\" wide (you should get 2–3 pieces per thigh). Combine chicken and remaining dressing in a large resealable plastic bag. Seal bag, pressing out any air. Turn to coat and chill at least 20 minutes and up to 1 day.\nPrepare a grill for medium-high heat; oil grate. Remove chicken from dressing; discard dressing. Thread 2 pieces of chicken onto each skewer. Season chicken lightly with salt and grill, turning occasionally, until golden brown and cooked through, 8–10 minutes.\nMeanwhile, drizzle onion with oil; season with salt. Grill until browned on both sides but still firm in center, about 3 minutes per side. Transfer to a large bowl and add tomatoes and a couple splashes of reserved dressing. Toss to coat; season salad with salt and pepper. Top salad and chicken with oregano leaves.\nServe chicken with salad, reserved dressing, and lemon wedges for squeezing over.",
            "Image": "//20fix.com/xfood/img/chicken-spiedie-skewers-with-italian-dressing.jpg"
        },
        {
            "id": "1934",
            "Title": "Italian Sausage with Grilled Broccolini, Kale, and Lemon",
            "Ingredients": {
                "1": "5 tablespoons olive oil, divided, plus more for grill",
                "2": "3 tablespoons crushed unsalted, roasted almonds",
                "3": "2 tablespoons fresh lemon juice",
                "4": "1 tablespoon drained capers",
                "5": "1 teaspoon honey",
                "6": "Kosher salt, freshly ground pepper",
                "7": "2 bunches broccolini (about 1 1/2 pounds)",
                "8": "1 bunch small Tuscan kale, tough stems removed",
                "9": "1 1/2 pounds coiled Italian sausage, preferably skewered, or links",
                "10": "1 lemon, thinly sliced into rounds, seeds removed",
                "11": "2 ounces mild Pecorino, shaved"
            },
            "Instructions": "Prepare a grill for medium-high, indirect heat (for a gas grill, leave one or two burners off; for a charcoal grill, bank coals on one side of grill); oil grate. Mix almonds, lemon juice, capers, honey, and 4 Tbsp. oil in a small bowl; season dressing with salt and pepper.\nCombine broccolini and kale in a large bowl and drizzle with remaining 1 Tbsp. oil. Toss well to evenly coat vegetables; season with salt.\nGrill sausage over direct heat until browned all over, about 3 minutes per side. Move to indirect heat and continue to cook, turning and rotating occasionally, until cooked through, 8–10 minutes. Transfer to a platter.\nMeanwhile, cook broccolini and kale over direct heat until kale is lightly browned and crisp around the edges and broccolini stem is crisp-tender, about 1 minute for kale and 3 minutes for broccolini. Transfer back to bowl.\nGrill lemon slices over direct heat until lightly browned, about 1 minute per side. Transfer to bowl with broccolini and kale and add half of dressing and half of Pecorino. Toss to combine; season salad with salt and pepper.\nMound some of the salad on top of the sausage and leave some in the bowl. Drizzle remaining dressing over all of the salad and top with remaining Pecorino.",
            "Image": "//20fix.com/xfood/img/italian-sausage-with-grilled-broccolini-kale-and-lemon.jpg"
        },
        {
            "id": "2284",
            "Title": "Instant-Pot Italian Chickpea Stew with Pesto",
            "Ingredients": {
                "1": "1 1/2 packed cups fresh basil leaves (about 3/4 ounce)",
                "2": "1/4 cup extra-virgin olive oil, plus additional if needed",
                "3": "1/4 cup grated Parmesan cheese (about 1 ounce)",
                "4": "1 garlic clove, minced",
                "5": "1 tablespoon toasted pine nuts",
                "6": "1 tablespoon plus 1/2 teaspoon kosher salt, divided",
                "7": "1 quart water",
                "8": "12 ounces dried chickpeas",
                "9": "2 tablespoons extra-virgin olive oil",
                "10": "1 small onion, chopped (about 3/4 cup)",
                "11": "2 medium carrots, peeled and chopped (about 3/4 cup)",
                "12": "1 (14-ounce) can diced tomatoes, undrained",
                "13": "4 cups chicken stock",
                "14": "1/4 cup grated Parmesan or similar cheese"
            },
            "Instructions": "Combine the basil, oil, cheese, garlic, and pine nuts in a small food processor or blender. Pulse until a coarse paste forms, adding a tablespoon or two of water or more olive oil, if necessary to get a loose-enough consistency. Set aside 1/3 cup of pesto for this recipe; the remainder can be refrigerated in an airtight container for a week or so, or frozen for several months.\nIn a large bowl, dissolve 1 tablespoon of kosher salt in the water. Add the chickpeas and soak at room temperature for 8 to 24 hours. Drain and rinse.\nPreheat the Instant Pot by selecting Sauté and adjust to More for high heat. Add the olive oil and heat until it shimmers. Add the onion and sprinkle with 1/4 teaspoon of salt. Cook, stirring frequently, until the onion pieces separate and soften, 2 to 3 minutes.\nAdd the drained chickpeas, carrots, tomatoes with their juice, stock, and remaining 1/4 teaspoon of salt. Lock the lid into place. Select Manual; adjust the pressure to High and the time to 10 minutes. After cooking, naturally release the pressure for 10 minutes, then quick release any remaining pressure. Unlock and remove the lid.\nLadle the chickpeas into bowls and top each with a spoonful of pesto. Sprinkle with the cheese and serve.",
            "Image": "//20fix.com/xfood/img/instant-pot-italian-chickpea-stew-with-pesto.jpg"
        },
        {
            "id": "3127",
            "Title": "Fresh Pasta With Clams And Hot Italian Sausage",
            "Ingredients": {
                "1": "1/2 cup plus 1 tablespoon all-purpose flour, plus more",
                "2": "1/4 cup semolina flour, plus more",
                "3": "1/4 teaspoon olive oil",
                "4": "2 tablespoons olive oil",
                "5": "4 ounces hot Italian sausage, casing removed",
                "6": "2 cloves garlic, thinly sliced",
                "7": "1 pound Manila or littleneck clams, scrubbed",
                "8": "1/4 cup dry white wine",
                "9": "Kosher salt",
                "10": "1 tablespoon unsalted butter",
                "11": "1 tablespoon finely chopped parsley"
            },
            "Instructions": "Combine 1/2 cup plus 1 Tbsp. all-purpose flour and 1/4 cup semolina flour in a large bowl. Add oil and 1/4 cup warm water and mix with a fork until a stiff dough forms. Turn out onto a lightly floured surface and knead until smooth and elastic, 8–10 minutes. Wrap tightly in plastic; let sit at room temperature 1 hour.\nCut dough in half. Working with a piece at a time and keeping remaining dough wrapped in plastic, roll dough into a 9x3/4\" log. Cut on a diagonal into 1/2\" pieces; dust with all-purpose flour.\nWorking with 1 piece of dough at a time, roll out between your palms to make about 3\" strands that taper at the ends. Dust pasta with semolina flour and place on a parchment-lined baking sheet. Cover with a kitchen towel until ready to use.\nHeat oil in large skillet over medium-high. Add sausage and cook, breaking into small pieces with a wooden spoon, until browned, about 5 minutes. Add garlic and cook, stirring, until softened, about 1 minute. Add clams and wine; cover. Cook, shaking skillet occasionally, until clams open, about 5 minutes; discard any that do not open.\nMeanwhile, cook pasta in a large pot of boiling salted water, stirring occasionally, until al dente, about 3 minutes. Drain, reserving 1 cup pasta cooking liquid.\nAdd butter, parsley, pasta, and 1/2 cup pasta cooking liquid to clams. Cook, tossing and adding more cooking liquid as needed, until sauce coats pasta, about 3 minutes. Taste and season with salt.",
            "Image": "//20fix.com/xfood/img/fresh-pasta-with-clams-and-hot-italian-sausage.jpg"
        },
        {
            "id": "3249",
            "Title": "Italian Kale Caesar Salad",
            "Ingredients": {
                "1": "1 large egg yolk",
                "2": "1 garlic clove, smashed, peeled, and trimmed",
                "3": "3 anchovy fillets, packed in oil, drained",
                "4": "1 tablespoon plus 1 1/2 teaspoons lemon juice",
                "5": "1 tablespoon plus 1 1/2 teaspoons red wine vinegar",
                "6": "1 tablespoon Dijon mustard",
                "7": "1 teaspoon dried oregano",
                "8": "1 teaspoon colatura (Italian fish sauce; optional)",
                "9": "1/4 teaspoon cayenne",
                "10": "1/2 cup canola oil",
                "11": "1/2 cup plus 2 tablespoons olive oil, divided",
                "12": "1/2 cup freshly grated grana padano cheese",
                "13": "Kosher salt",
                "14": "Freshly ground black pepper",
                "15": "4 ounces country bread, crusts removed, bread torn into small pieces",
                "16": "Two (5-ounce) containers baby kale"
            },
            "Instructions": "Preheat oven to 400°F. Pulse egg yolk, garlic, anchovies, lemon juice, vinegar, mustard, oregano, colatura (if using), and cayenne in a food processor or blender until smooth. Combine canola oil and 1/2 cup olive oil in a measuring cup with spout. With the motor running, add blended oil in a very thin stream; purée until a creamy emulsion forms. Add cheese and pulse to combine. Season dressing with salt and pepper.\nToss bread with remaining 2 Tbsp. olive oil and spread on a rimmed baking sheet. Bake, tossing once or twice, until crisp and lightly browned, about 10 minutes. Let cool completely.\nCombine kale and croutons in a large bowl. Add 1/2 cup dressing and toss to combine.\nDressing can be made up to 5 days ahead. Refrigerate in an airtight container.",
            "Image": "//20fix.com/xfood/img/italian-kale-caesar-salad.jpg"
        },
        {
            "id": "3326",
            "Title": "Tortellini with Italian Sausage, Fennel, and Mushroom",
            "Ingredients": {
                "1": "1 tablespoon olive oil",
                "2": "1 large fennel bulb, trimmed, halved through core, thinly sliced lengthwise (about 3 cups), fronds chopped",
                "3": "1 pound spicy Italian sausages, casings removed, sausage coarsely crumbled",
                "4": "1 (8-ounce) package sliced fresh crimini (baby bella) mushrooms",
                "5": "4 large garlic cloves, pressed",
                "6": "1 tablespoon fennel seeds, coarsely crushed",
                "7": "1/2 cup heavy whipping cream",
                "8": "1 cup (or more) low-salt chicken broth",
                "9": "1 (16-ounce) package dried tortellini with pesto filling or fresh tortellini with 3-cheese filling",
                "10": "1 (5-ounce) package fresh baby spinach leaves",
                "11": "1/2 cup finely grated Parmesan cheese plus additional (for serving)"
            },
            "Instructions": "Heat oil in large nonstick skillet over medium-high heat. Add sliced fennel bulb, sausage, and mushrooms; sauté until sausage is brown and cooked through and fennel is almost tender, 12 to 15 minutes. Add garlic and fennel seeds; stir 1 minute. Stir in cream, then 1 cup broth; boil until liquid is reduced and very slightly thickened, 2 to 3 minutes.\nMeanwhile, cook tortellini in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain tortellini; return to same pot.\nAdd sausage mixture to tortellini in pot. Toss over medium heat until blended. Add spinach; toss gently until spinach wilts. Stir in 1/2 cup cheese; add more broth by 1/4 cupfuls to moisten if dry. Season with salt and pepper, sprinkle with chopped fennel fronds, and serve, passing additional cheese.",
            "Image": "//20fix.com/xfood/img/tortellini-with-italian-sausage-fennel-and-mushroom-362553.jpg"
        },
        {
            "id": "4270",
            "Title": "Sourdough, Italian Sausage, and Chestnut Stuffing",
            "Ingredients": {
                "1": "3/4 cup (1 1/2 sticks) unsalted butter, cut into pieces, divided, plus more",
                "2": "10 cups coarsely torn sourdough bread, dried out overnight",
                "3": "2 tablespoons plus 1/4 cup olive oil",
                "4": "1/2 cup chopped roasted chestnuts",
                "5": "Kosher salt, freshly ground pepper",
                "6": "1 pound sweet Italian sausage, casings removed",
                "7": "2 medium onions, chopped",
                "8": "4 celery stalks, chopped",
                "9": "2 chiles de árbol",
                "10": "1 large Pink Lady apple, thinly sliced",
                "11": "2 garlic cloves, finely chopped",
                "12": "1/4 cup finely chopped fresh sage",
                "13": "1/2 cup very dry Sherry",
                "14": "2 large eggs",
                "15": "3 cups chicken stock or low-sodium chicken broth, divided"
            },
            "Instructions": "Preheat oven to 350°. Butter a shallow 3-quart baking dish and a sheet of foil. Place bread in a very large bowl.\nHeat 2 tablespoons oil in a small saucepan over medium heat. Add chestnuts, season with salt and pepper, and cook, stirring often, until chestnuts are golden and crisp, about 5 minutes. Transfer to bowl with bread with a slotted spoon.\nHeat remaining 1/4 cup oil in a large skillet over medium-high. Add sausage and cook, stirring occasionally and breaking into small pieces with a wooden spoon, until browned and cooked through, 8–10 minutes. Transfer to bowl with slotted spoon.\nAdd onions, celery, and chiles to skillet, season with salt and pepper, and cook, stirring often, until onions are translucent and soft, 5–7 minutes. Add apple, garlic, and sage and cook, stirring occasionally, until onions are golden brown and apple is soft, about 5 minutes. Discard chiles. Add onion mixture to bowl.\nAdd onions, celery, and chiles to skillet, season with salt and pepper, and cook, stirring often, until onions are translucent and soft, 5–7 minutes. Add apple, garlic, and sage and cook, stirring occasionally, until onions are golden brown and apple is soft, about 5 minutes. Discard chiles. Add onion mixture to bowl.\nReduce heat to medium and cook Sherry in skillet, scraping up any browned bits, until almost all evaporated, about 1 minute. Add 1/2 cup butter; cook, stirring, until melted. Drizzle over bread mixture.\nWhisk eggs and 2 cups stock in a medium bowl; pour over bread mixture. Season with salt and pepper and toss, adding more stock 1/4-cupful at a time as needed (you may not use it all), until combined and bread is hydrated. Transfer to prepared dish and dot with remaining 1/4 cup butter.\nCover with buttered foil; bake until a paring knife inserted into the center comes out hot, 30–35 minutes. Increase oven temperature to 450°. Uncover and bake until top is golden brown and crisp, 20–25 minutes. Let sit 10 minutes before serving.\nDo ahead: Stuffing can be assembled 1 day ahead. Cover and chill.",
            "Image": "//20fix.com/xfood/img/sourdough-italian-sausage-and-chestnut-stuffing-51255150.jpg"
        },
        {
            "id": "4721",
            "Title": "Italian Rice Pie (Pastiera di Riso)",
            "Ingredients": {
                "1": "3 1/4 cups all-purpose flour",
                "2": "6 tablespoons sugar",
                "3": "1 1/2 teaspoons baking powder",
                "4": "3/4 teaspoon salt",
                "5": "2 sticks (1 cup) cold unsalted butter, cut into tablespoon pieces",
                "6": "3 large eggs, lightly beaten",
                "7": "3/4 cup Arborio rice",
                "8": "4 cups water",
                "9": "5 large egg yolks, divided",
                "10": "2/3 cup sugar",
                "11": "1 1/2 tablespoons cornstarch",
                "12": "1/4 cup all-purpose flour",
                "13": "2 cups whole milk",
                "14": "3 tablespoons unsalted butter",
                "15": "1 teaspoon pure vanilla extract",
                "16": "1 pound ricotta (preferably fresh or homemade ; 2 cups)",
                "17": "1 1/2 teaspoons grated orange zest",
                "18": "1 1/2 teaspoons grated lemon zest",
                "19": "1/4 teaspoon cinnamon",
                "20": "1/4 teaspoon salt",
                "21": "1 large egg, lightly beaten",
                "22": "Strawberries in Sambuca"
            },
            "Instructions": "Pulse flour, sugar, baking powder, and salt in a food processor until combined. Add butter and pulse until mixture resembles coarse meal with some roughly pea-size butter lumps. Add eggs and pulse until just incorporated and dough begins to form large clumps.\nTurn out dough onto a work surface and divide into 6 portions. With heel of your hand, smear each portion once or twice in a forward motion to help distribute fat. Gather dough together, using a pastry scraper if you have one, and form into a thick log. Cut off 2/3 of the log and form into a large rectangle for the bottom of the pie. Form the remaining piece into a smaller rectangle for the top of the pie. Chill each, wrapped in plastic wrap, until firm, at least 30 minutes.\nBring rice and well-salted water to a boil in a 2-quart saucepan, then reduce heat and simmer, covered, until rice is tender, about 20 minutes. Drain in a sieve and rinse under cold water until cool. Drain well.\nWhisk together 3 yolks and sugar in a heatproof bowl, then whisk in cornstarch and flour until smooth (mixture will be very thick). Bring milk just to a boil in a small heavy saucepan, then gradually add hot milk to yolk mixture, whisking.\nPour custard back into saucepan and bring to a boil over medium-low heat, whisking constantly (custard will become very thick), then boil, whisking, 1 minute. Remove from heat and whisk in butter and vanilla. Transfer to a bowl and chill, its surface covered with wax paper, until cold, about 2 hours.\nStir together ricotta, custard, and remaining 2 yolks, then stir in zests, cinnamon, salt, and cooked rice.\nPreheat oven to 350°F with rack in middle. Generously butter a 13- by 9-inch metal baking pan and line the bottom with an overlapping double layer of foil, leaving 2 inches of overhang on both ends, then generously butter foil.\nRoll out 1 piece of dough between 2 sheets of wax paper into a 15- by 11-inch rectangle (about 1/8 inch thick). If dough becomes soft, chill or freeze until firm. Remove top sheet of wax paper and invert into baking pan, fitting it into pan. Chill shell. Roll out remaining piece of dough between sheets of wax paper in same manner. Cut 12 (3/4-inch-wide) crosswise strips (you will have a little dough left over).\nSpread filling in pan and arrange 6 strips, 1 1/4 inches apart, diagonally across filling, trimming ends to fit. Arrange remaining 6 strips, 1 1/4 inches apart, diagonally across first strips to form a lattice with diamond-shaped spaces. Trim lattice to fit in pan, then fold outside crust down over filling to make a border. Brush pastry with beaten egg.\nBake pie until pastry is golden and filling is puffed and set, about 1 1/2 hours, loosely covering top of pie with foil after 50 minutes to prevent over-browning. Transfer to a rack to cool. When completely cool, lift pie out of pan using foil overhang and transfer to a platter.",
            "Image": "//20fix.com/xfood/img/italian-rice-pie-pastiera-di-riso-51233420.jpg"
        },
        {
            "id": "5062",
            "Title": "Turkey Breast Stuffed with Italian Sausage and Marsala-Steeped Cranberries",
            "Ingredients": {
                "1": "2/3 cup dried cranberries",
                "2": "7 tablespoons Marsala",
                "3": "2 tablespoons olive oil",
                "4": "2 echalion or banana shallots, peeled and finely chopped",
                "5": "1/4 teaspoon ground cloves",
                "6": "1/2 teaspoon ground allspice",
                "7": "2 teaspoons chopped fresh sage",
                "8": "2 1/4 pounds Italian sausages",
                "9": "2 eggs, beaten",
                "10": "approx. 1/2 cup grated Parmesan",
                "11": "approx. 1 cup bread crumbs",
                "12": "1 X 11-pound boneless (double) turkey breast, butterflied, with skin left on",
                "13": "1/4 cup duck or goose fat"
            },
            "Instructions": "Put the cranberries and Marsala into a small saucepan and bring to a boil, then take off the heat and leave to one side.\nPut the oil into a large frying pan or similar heavy pan, and fry the shallots for a minute or so, then add the spices and chopped sage, turning them in the soft shallots.\nSqueeze the sausage meat out of its skins, add to the pan, and break it up—using a wooden fork and spatula for ease—turning it in the hot pan until it loses its pinkness. This will take about 5 minutes.\nTake the frying pan off the heat and turn the contents into a large bowl, mixing in the steeped cranberries and any Marsala clinging to them, and leave to cool. You can cover with plastic wrap and put in the refrigerator for up to 2 days at this stage. When you are ready to stuff the turkey breast, take the bowl of sausage meat out of the refrigerator.\nPreheat the oven to 400°F.\nUncover the bowl of sausage meat, add the eggs, Parmesan, and bread crumbs and—I use my hands for this—mix well. Lay the butterflied turkey joint out in front of you. It really does look like a butterfly, though admittedly a fleshy one. Spread the stuffing out first in the slight cavity in the center of the butterfly and then outward onto the wings though not going right up to the edge (or it will squidge out when cooking) but as evenly as possible over the whole joint.\nCarefully, in one swift but steady movement, fold one \"wing\" over the other to close the joint, and then sit the turkey in a large roasting pan, breast bone (or where the breast bone would be) on top as it would look were it the whole bird, with the pointier bit farthest away from you. Thread 2 skewers through the base—i.e., the widest part that is nearer you—to keep it closed, and smear it all over with the duck or goose fat.\nRoast the turkey breast for 2–2 1/2 hours, then check it is cooked with a turkey or meat thermometer. When cooked, it should read 165°F in the center. (If you're leaving it to rest, as you should, or to cool, you could take it out at 160°F—it will retain heat and continue to cook for a short while once out of the oven.)\nFlex your muscles, then lift out onto a cutting board, and leave to rest for at least 20 minutes. Or leave to get cold if you are eating it as part of a cook-ahead buffet.\nCut through the whole joint in wide slices right across; they will need to be quite thick, at least 1/2 inch, maybe 1 inch, to keep the stuffing intact within the slice.\nAs you place it on table or sideboard, dot around it the condiments of your choice: I revert to Christmas in Italy here by putting a lusciously extravagant pot or two of Italian mostarda di Cremona on the table alongside: this is a hot and sweet preserve of mustardy candied fruits that gleam beautifully and taste both festive and fabulous.",
            "Image": "//20fix.com/xfood/img/turkey-breast-stuffed-with-italian-sausage-and-marsala-steeped-cranberries-51204010.jpg"
        },
        {
            "id": "5697",
            "Title": "Italian Vegetable Stew",
            "Ingredients": {
                "1": "1/2 1-pound loaf sourdough bread, torn into 2\" pieces (about 6 cups)",
                "2": "1 bunch collard greens, center ribs and stems removed",
                "3": "1 bunch Tuscan or other kale, center ribs and stems removed",
                "4": "Kosher salt",
                "5": "1/2 cup olive oil, divided, plus more for serving",
                "6": "2 medium carrots, peeled, finely chopped",
                "7": "2 celery stalks, finely chopped",
                "8": "1 leek, white and pale-green parts only, chopped",
                "9": "4 garlic cloves, chopped",
                "10": "1/2 teaspoons crushed red pepper flakes",
                "11": "1 28-ounce can whole peeled tomatoes, drained",
                "12": "8 cups low-sodium vegetable broth",
                "13": "3 15-ounce cans cannellini (white kidney) beans, rinsed",
                "14": "4 sprigs thyme",
                "15": "1 sprig marjoram or oregano",
                "16": "1 bay leaf",
                "17": "Freshly ground black pepper",
                "18": "Shaved Parmesan (for serving)"
            },
            "Instructions": "Scatter bread on a rimmed baking sheet in a single layer. Let stand at room temperature to slightly dry out, about 2 hours.\nWorking in batches, cook collards and kale separately in a large pot of boiling salted water until slightly softened, about 3 minutes per batch. Rinse to cool. Squeeze out excess water; roughly chop. Set aside.\nHeat 1/4 cup oil in a large heavy pot over medium heat. Add carrots, celery, and leek; stir often until softened, 8-10 minutes.\nAdd garlic and red pepper flakes. Cook, stirring until fragrant, about 1 minute. Add tomatoes, crushing with your hands as you add them. Cook, stirring frequently, until liquid is evaporated and tomatoes begin to stick to the bottom of the pot, 10-15 minutes.\nAdd broth, beans, thyme, marjoram, bay leaf, and reserved greens; season with salt and pepper. Bring to a boil, reduce heat, and simmer until flavors meld and soup thickens slightly, 40-50 minutes. DO AHEAD: Soup can be made 2 days ahead. Let cool slightly; chill until cold. Cover and keep chilled. Reheat before continuing. Store bread airtight at room temperature.\nJust before serving, gently stir bread and 1/4 cup oil into soup. Divide among bowls, top with Parmesan, and drizzle with oil.",
            "Image": "//20fix.com/xfood/img/italian-vegetable-stew-51149120.jpg"
        },
        {
            "id": "5954",
            "Title": "Italian Mother-In-Law Dressing",
            "Ingredients": {
                "1": "1/4 cup (1/2 stick) unsalted butter plus more for baking dish",
                "2": "1/4 cup golden raisins",
                "3": "3 cups low-sodium chicken broth, divided",
                "4": "1 pound good-quality day-old country bread, torn into 1/2\" pieces (about 10 cups)",
                "5": "8 tablespoons olive oil, divided",
                "6": "1 bunch red Swiss chard, center ribs and stems removed and cut into 1/2\" pieces, leaves torn",
                "7": "2 1/2 cups chopped yellow onions",
                "8": "5 garlic cloves, chopped",
                "9": "1/4 cup red wine vinegar",
                "10": "1 tablespoon sugar",
                "11": "1 cup pitted green olives, 3 coarsely chopped",
                "12": "4 ounces pine nuts (about 1/2 cup), toasted",
                "13": "1 tablespoon chopped fresh oregano",
                "14": "1 tablespoon chopped fresh rosemary",
                "15": "2 teaspoons kosher salt",
                "16": "1/2 teaspoon crushed red pepper flakes",
                "17": "2 large eggs"
            },
            "Instructions": "Preheat oven to 250°F. Butter a 13x9x2\" baking dish; set aside. Soak raisins in 1 cup broth in a small bowl for 30 minutes.\nScatter bread in a single layer on a rimmed baking sheet. Bake, stirring occasionally, until dried out, about 1 hour. Let cool and transfer to a very large bowl.\nHeat 2 tablespoons oil in a large skillet over medium-high heat; add Swiss chard leaves and stir constantly until just wilted. Transfer to bowl with bread. Heat 2 tablespoons oil in same skillet; add stems and cook, stirring often, until crisp-tender, 3-5 minutes. Add to bowl.\nHeat 4 tablespoons oil and 1/4 cup butter in same skillet; add onions and garlic. Stir often until just beginning to brown, about 10 minutes. Stir in vinegar and sugar; cook until vinegar is almost evaporated, about 5 minutes.\nAdd onion mixture to chard in bowl. Add raisins with broth, olives, and next 5 ingredients; gently fold into bread mixture until thoroughly combined. Drizzle in 1 cup broth and toss gently. Let cool completely.\nPreheat oven to 350°F. Whisk remaining 1 cup broth and eggs in a small bowl. Gently fold into dressing until thoroughly combined. Transfer to prepared dish, cover with foil, and bake until an instant-read thermometer inserted into the center of dressing registers 160°F, about 40 minutes. DO AHEAD: Dressing can be made 1 day ahead. Uncover; let cool. Cover; chill.\nBake dressing, uncovered, until set and top is browned and crisp, 40-45 minutes longer (if chilled, add 10-15 minutes).",
            "Image": "//20fix.com/xfood/img/italian-mother-in-law-dressing-51124220.jpg"
        },
        {
            "id": "5996",
            "Title": "Braised Italian-Style Pot Roast",
            "Ingredients": {
                "1": "One 5-inch sprig fresh thyme",
                "2": "5 fresh Italian, flat leafed parsley stems",
                "3": "2 dried bay leaves or 1 fresh bay leaf",
                "4": "One 5-inch sprig fresh rosemary",
                "5": "2 juniper berries, crushed",
                "6": "One 2-pound piece shoulder of beef, bottom round, or pot roast",
                "7": "Kosher salt and freshly ground black pepper",
                "8": "All-purpose flour for dusting",
                "9": "5 tablespoons butter",
                "10": "1 cup coarsely chopped celery (about 2 stalks)",
                "11": "1 1/4 cups coarsely chopped onion (1 medium-size onion)",
                "12": "1/2 cup coarsely chopped carrot (1 medium-size carrot)",
                "13": "1 bottle (750ml) dry red wine",
                "14": "1/2 cup dried porcini mushrooms, coarsely chopped and soaked in 1 cup warm water",
                "15": "1 tablespoon tomato paste",
                "16": "2 cups canned whole or crushed plum tomatoes",
                "17": "Chicken broth or water as needed",
                "18": "2 tablespoons arrowroot or cornstarch",
                "19": "1/4 cup dry red or white wine"
            },
            "Instructions": "Combine all the ingredients in the center of a piece of cheesecloth that is large enough to hold the herb sprigs, and tie in a bundle with butcher's string.\n1. Preheat the oven to 350°F.\n2. Season the beef with salt and pepper, then lightly dust with flour. Melt the butter in a large (6-quart) flameproof casserole set over medium-high heat. When it is foaming, add the beef and brown it on all sides, 5 minutes. Add the celery, onions, carrot, and sacchétto di spezie. Cook, stirring occasionally, until the vegetables soften slightly, about 2 minutes. Raise the heat to high and add the bottle of wine. Cook until the wine begins to boil, about 2 more minutes, skimming off any fat that rises to the surface.\n3. Strain the porcini mushrooms through a fine-mesh sieve, reserving the liquid. Rinse the mushrooms under cold running water to remove any grit, and add them to the casserole along with the strained mushroom liquid, tomato paste, and tomatoes. The liquid should just cover the meat. If it does not, add chicken broth or water. Cover the casserole and bake it in the oven until the meat is cooked through and tender, about 2 hours. Remove the meat from the casserole to a cutting board, cover with aluminum foil, and set aside.\n4. Strain the broth through a fine-mesh sieve and discard the vegetables and herb bag. Pour the broth back into the casserole and set it over high heat. Bring to a boil and add the arrowroot and the 1/4 cup wine. Cook to reduce and thicken the liquid, about 5 minutes. Carve the meat into 1/4-inch-thick slices. Serve immediately, spooning some of the broth over each portion.",
            "Image": "//20fix.com/xfood/img/braised-italian-style-pot-roast-51119610.jpg"
        },
        {
            "id": "6776",
            "Title": "Linguine with Italian Tuna and White Beans",
            "Ingredients": {
                "1": "8 ounces spinach linguine",
                "2": "8 ounces canned Italian tuna packed in oil",
                "3": "1/4 cup fresh lemon juice",
                "4": "2 large cloves garlic, chopped",
                "5": "1 teaspoon salt",
                "6": "1/2 teaspoon freshly ground black pepper",
                "7": "1 can (15 ounces) cannellini beans, rinsed and drained",
                "8": "1 small red onion, thinly sliced",
                "9": "1/2 cup chopped Italian leaf parsley, plus whole leaves for garnish",
                "10": "1/2 thinly sliced lemon (optional)"
            },
            "Instructions": "Cook pasta as directed on package; drain and rinse under cold water. Drain tuna, reserving oil in a salad bowl; whisk juice, garlic, salt and pepper with oil. Flake tuna into same bowl. Add pasta, beans, onion and chopped parsley; toss gently to coat with dressing. Serve garnished with parsley leaves and lemon slices, if desired.",
            "Image": "//20fix.com/xfood/img/linguine-with-italian-tuna-and-white-beans-367811.jpg"
        },
        {
            "id": "7209",
            "Title": "Spicy Tomato Sauce from Giada de Laurentiis's Everyday Italian",
            "Ingredients": {
                "1": "3 tablespoons extra-virgin olive oil",
                "2": "1 small onion, minced",
                "3": "2 garlic cloves, minced",
                "4": "1/2 cup pitted black olives, coarsely chopped",
                "5": "2 tablespoons drained capers, rinsed",
                "6": "1/2 teaspoon sea salt, plus more to taste",
                "7": "Generous pinch of dried crushed red pepper flakes",
                "8": "1 28-ounce can crushed Italian tomatoes"
            },
            "Instructions": "In a large skillet, heat the oil over a medium-high flame. When almost smoking, add the onion and garlic and sauté for 3 minutes. Reduce the heat to medium and add the olives, capers, 1/2 teaspoon of salt, and red pepper flakes, and sauté for 1 minute. Add the tomatoes and simmer until reduced slightly, about 20 minutes. Season the sauce with more salt to taste. (The sauce can be made 1 day ahead. Cool, then cover and refrigerate. Rewarm over medium heat before using.)",
            "Image": "//20fix.com/xfood/img/spicy-tomato-sauce-from-giada-de-laurentiiss-everyday-italian-363324.jpg"
        }
    ],
    "t": 45,
    "p": {
        "limitstart": 0,
        "limit": 25,
        "total": 45,
        "pagesStart": 1,
        "pagesStop": 2,
        "pagesCurrent": 1,
        "pagesTotal": 2
    }
}